/* nothing */
"" = "Project-Id-Version: xchat-2.8.4\nReport-Msgid-Bugs-To: www.xchat.org\nPOT-Creation-Date: 2007-06-24 13:05+1000\nPO-Revision-Date: 2007-06-27 20:53+0300\nLast-Translator: Mika Laari <laari@iki.fi>\nLanguage-Team: Finnish <translation-team-fi@lists.sourceforge.net>\nMIME-Version: 1.0\nContent-Type: text/plain; charset=UTF-8\nContent-Transfer-Encoding: 8bit\nX-Generator: KBabel 1.11.4\n";

/* nothing */
"Cannot create ~/.xchat2" = "Hakemiston ~/.xchat2 luominen epäonnistui";

/* nothing */
"I'm busy" = "Olen kiireinen";

/* nothing */
"Leaving" = "Lähdössä";

/* nothing */
"* Running IRC as root is stupid! You should\n  create a User Account and use that to login.\n" = "* IRCin ajaminen pääkäyttäjänä on typerää!\n  Luo tavallinen käyttäjätunnus ja kirjaudu sillä.\n";

/* nothing */
"Waiting" = "Odottaa";

/* nothing */
"Active" = "Aktiivinen";

/* nothing */
"Failed" = "Epäonnistui";

/* nothing */
"Done" = "Valmis";

/* nothing */
"Connect" = "Yhdistetty";

/* nothing */
"Aborted" = "Keskeytetty";

/* nothing */
"Cannot access %s\n" = "Tiedostoa %s ei voi käyttää\n";

/* nothing */
"Error" = "Virhe";

/* nothing */
"%s is offering \"%s\". Do you want to accept?" = "%s tarjoaa tiedostoa \"%s\". Hyväksytäänkö?";

/* nothing */
"No active DCCs\n" = "Ei aktiivisia DCC-yhteyksiä\n";

/* nothing */
"YES  " = "JAA  ";

/* nothing */
"NO   " = "EI   ";

/* nothing */
"You are being CTCP flooded from %s, ignoring %s\n" = "CTCP-tulva käyttäjältä %s, ei huomioida osoitetta %s\n";

/* nothing */
"You are being MSG flooded from %s, setting gui_auto_open_dialog OFF.\n" = "Viestitulva käyttäjältä %s, poistetaan automaattinen keskustelunavaus käytöstä.\n";

/* nothing */
"  %-20s online\n" = "  %-14s tavoitettavissa\n";

/* nothing */
"  %-20s offline\n" = "  %-14s tavoittamattomissa\n";

/* nothing */
"No channel joined. Try /join #<channel>\n" = "Millekään kanavalle ei ole liitytty. Kokeile /join #<kanava>\n";

/* nothing */
"Not connected. Try /server <host> [<port>]\n" = "Mihinkään palvelimeen ei ole yhteyttä. Kokeile /server <isäntä> [<portti>]\n";

/* nothing */
"Already marked away: %s\n" = "Merkitty jo poissaolevaksi: %s\n";

/* nothing */
"Already marked back.\n" = "Merkitty jo läsnäolevaksi.\n";

/* nothing */
"I need /bin/sh to run!\n" = "Ajamiseen vaaditaan /bin/sh!\n";

/* nothing */
"Commands Available:" = "Käytettävissä olevat komennot:";

/* nothing */
"User defined commands:" = "Käyttäjän määrittelemät komennot:";

/* nothing */
"Plugin defined commands:" = "Liitännäisten komennot:";

/* nothing */
"Type /HELP <command> for more information, or /HELP -l" = "Lisätietoja saat kirjoittamalla /HELP <komento> tai /HELP -l.";

/* nothing */
"Unknown arg '%s' ignored." = "Tuntematonta argumenttia \"%s\" ei huomioida.";

/* nothing */
"No such plugin found.\n" = "Liitännäistä ei löydy.\n";

/* nothing */
"That plugin is refusing to unload.\n" = "Liitännäinen ei suostu poistumaan käytöstä.\n";

/* nothing */
"ADDBUTTON <name> <action>, adds a button under the user-list" = "ADDBUTTON <nimi> <toiminto>, lisää painikkeen käyttäjäluettelon alapuolelle";

/* nothing */
"ALLCHAN <cmd>, sends a command to all channels you're in" = "ALLCHAN <komento>, lähettää komennon kaikille kanaville, joilla ollaan";

/* nothing */
"ALLCHANL <cmd>, sends a command to all channels you're in" = "ALLCHANL <komento>, lähettää komennon kaikille kanaville, joilla olet.";

/* nothing */
"ALLSERV <cmd>, sends a command to all servers you're in" = "ALLSERV <komento>, lähettää komennon kaikille palvelimille, joilla ollaan";

/* nothing */
"AWAY [<reason>], sets you away" = "AWAY [<syy>], merkitsee poissaolevaksi";

/* nothing */
"BACK, sets you back (not away)" = "BACK, merkitsee läsnäolevaksi";

/* nothing */
"BAN <mask> [<bantype>], bans everyone matching the mask from the current channel. If they are already on the channel this doesn't kick them (needs chanop)" = "BAN <peite> [<bannityyppi>], bannaa jokaisen peitteeseen täsmäävän käyttäjän nykyiseltä kanavalta. Jos käyttäjät ovat jo kanavalla, tämä komento ei potkaise heitä (vaatii opit)";

/* nothing */
"Set per channel options\nCHANOPT CONFMODE ON|OFF - Toggle conf mode/showing of join and part messages\nCHANOPT COLORPASTE ON|OFF - Toggle color paste\nCHANOPT BEEP ON|OFF - Toggle beep on message\nCHANOPT TRAY ON|OFF - Toggle tray blink on message" = "Kanavakohtaiset asetukset\nCHANOPT CONFMODE ON|OFF - Liittymis- ja poistumisviestit päälle tai pois\nCHANOPT COLORPASTE ON|OFF - Värien kanssa liittäminen päälle tai pois\nCHANOPT BEEP ON|OFF - Piippaus viestien saapuessa päälle tai pois\nCHANOPT TRAY ON|OFF - Ilmoitusalueella välkytys päälle tai pois";

/* nothing */
"CLEAR [ALL|HISTORY], Clears the current text window or command history" = "CLEAR [ALL|HISTORY], tyhjentää nykyisen teksti-ikkunan tai komentohistorian";

/* nothing */
"CLOSE, Closes the current window/tab" = "CLOSE, sulkee nykyisen ikkunan/välilehden";

/* nothing */
"COUNTRY [-s] <code|wildcard>, finds a country code, eg: au = australia" = "COUNTRY [-s] <koodi|jokeri>, etsii maakoodin, esim. au = Australia.";

/* nothing */
"CTCP <nick> <message>, send the CTCP message to nick, common messages are VERSION and USERINFO" = "CTCP <käyttäjä> <viesti>, lähettää CTCP-viestin käyttäjälle, yleiset viestit ovat VERSION ja USERINFO";

/* nothing */
"CYCLE [<channel>], parts the current or given channel and immediately rejoins" = "CYCLE, poistuu nykyiseltä kanavalta ja palaa heti takaisin";

/* nothing */
"\nDCC GET <nick>                      - accept an offered file\nDCC SEND [-maxcps=#] <nick> [file]  - send a file to someone\nDCC PSEND [-maxcps=#] <nick> [file] - send a file using passive mode\nDCC LIST                            - show DCC list\nDCC CHAT <nick>                     - offer DCC CHAT to someone\nDCC PCHAT <nick>                    - offer DCC CHAT using passive mode\nDCC CLOSE <type> <nick> <file>         example:\n         /dcc close send johnsmith file.tar.gz" = "\nDCC GET <kutsumanimi>                    - hyväksy tarjottu tiedosto\nDCC SEND [-maxcps=#] <knimi> [tiedosto]  - lähetä tiedosto jollekulle\nDCC PSEND [-maxcps=#] <knimi> [tiedosto] - lähetä tiedosto passiivitilaisena\nDCC LIST                                 - näytä DCC-luettelo\nDCC CHAT <kutsumanimi>                   - ehdota DCC-keskustelua jollekulle\nDCC PCHAT <kutsumanimi>                  - ehdota DCC-keskustelua passiivitilaisena\nDCC CLOSE <tyyppi> <knimi> <tiedosto>    - keskeytä DCC-siirto, esimerkiksi:\n         /dcc close send jarkkoranta tiedosto.tar.gz";

/* nothing */
"DEHOP <nick>, removes chanhalf-op status from the nick on the current channel (needs chanop)" = "DEHOP <käyttäjä>, poistaa puoliopit käyttäjältä nykyisellä kanavalla (vaatii opit)";

/* nothing */
"DELBUTTON <name>, deletes a button from under the user-list" = "DELBUTTON <nimi>, poistaa painikkeen käyttäjäluettelon alta";

/* nothing */
"DEOP <nick>, removes chanop status from the nick on the current channel (needs chanop)" = "DEOP <käyttäjä>, poistaa opit käyttäjältä nykyisellä kanavalla (vaatii opit)";

/* nothing */
"DEVOICE <nick>, removes voice status from the nick on the current channel (needs chanop)" = "DEVOICE <käyttäjä>, poistaa puheoikeuden käyttäjältä nykyisellä kanavalla (vaatii opit)";

/* nothing */
"DISCON, Disconnects from server" = "DISCON, Katkaisee yhteyden palvelimelle";

/* nothing */
"DNS <nick|host|ip>, Finds a users IP number" = "DNS <käyttäjä|isäntä|ip>, etsii käyttäjän IP-osoitteen";

/* nothing */
"ECHO <text>, Prints text locally" = "ECHO <teksti>, tulostaa tekstiä paikallisesti";

/* nothing */
"EXEC [-o] <command>, runs the command. If -o flag is used then output is sent to current channel, else is printed to current text box" = "EXEC [-o] <komento>, ajaa komennon. Käytettäessä valitsinta -o tuloste lähetetään nykyiselle kanavalle, muutoin nykyiseen ikkunaan";

/* nothing */
"EXECCONT, sends the process SIGCONT" = "EXECCONT, lähettää prosessille signaalin SIGCONT";

/* nothing */
"EXECKILL [-9], kills a running exec in the current session. If -9 is given the process is SIGKILL'ed" = "EXECKILL [-9], tappaa nykyisestä istunnosta käynnistetyn ohjelman. Käytettäessä valitsinta -9, prosessille lähetetään signaali SIGKILL";

/* nothing */
"EXECSTOP, sends the process SIGSTOP" = "EXECSTOP, lähettää prosessille signaalin SIGSTOP";

/* nothing */
"EXECWRITE, sends data to the processes stdin" = "EXECWRITE, lähettää dataa prosessin vakiosyötteeseen";

/* nothing */
"FLUSHQ, flushes the current server's send queue" = "FLUSHQ, tyhjentää nykyisen palvelimen lähetysjonon";

/* nothing */
"GATE <host> [<port>], proxies through a host, port defaults to 23" = "GATE <isäntä> [<portti>], käyttää isäntää välipalvelimena, oletusportti 23";

/* nothing */
"GHOST <nick> <password>, Kills a ghosted nickname" = "GHOST <kutsumanimi> <salasana>, poistaa kummittelemaan jääneen kutsumanimen";

/* nothing */
"HOP <nick>, gives chanhalf-op status to the nick (needs chanop)" = "HOP <käyttäjä>, antaa puoliopit käyttäjälle (vaatii opit)";

/* nothing */
"ID <password>, identifies yourself to nickserv" = "ID <salasana>, tunnistautuu NickServ-palvelulle.";

/* nothing */
"IGNORE <mask> <types..> <options..>\n    mask - host mask to ignore, eg: *!*@*.aol.com\n    types - types of data to ignore, one or all of:\n            PRIV, CHAN, NOTI, CTCP, DCC, INVI, ALL\n    options - NOSAVE, QUIET" = "IGNORE <peite> <tyypit..> <valitsimet..>\n    peite - peite, jonka mukaan jätetään huomiotta, esim: *!*@*.aol.com\n    tyypit - viestityypit, jotka jätetään huomiotta, yksi tai useampi:\n            PRIV, CHAN, NOTI, CTCP, DCC, INVI, ALL\n    valitsimet - NOSAVE, QUIET";

/* nothing */
"INVITE <nick> [<channel>], invites someone to a channel, by default the current channel (needs chanop)" = "INVITE <käyttäjä> [<kanava>], kutsuu käyttäjän kanavalle, oletuksena nykyiselle (vaatii opit)";

/* nothing */
"JOIN <channel>, joins the channel" = "JOIN <kanava>, liittyy kanavalle";

/* nothing */
"KICK <nick>, kicks the nick from the current channel (needs chanop)" = "KICK <käyttäjä>, potkaisee käyttäjän nykyiseltä kanavalta (vaatii opit)";

/* nothing */
"KICKBAN <nick>, bans then kicks the nick from the current channel (needs chanop)" = "KICKBAN <käyttäjä>, bannaa ja potkaisee käyttäjän nykyiseltä kanavalta (vaatii opit)";

/* nothing */
"LAGCHECK, forces a new lag check" = "LAGCHECK, pakottaa uuden viivetarkistuksen";

/* nothing */
"LASTLOG <string>, searches for a string in the buffer" = "LASTLOG <merkkijono>, etsii merkkijonoa puskurista";

/* nothing */
"LOAD [-e] <file>, loads a plugin or script" = "LOAD [-e] <tiedosto>, lataa liitännäisen tai komentotiedoston.";

/* nothing */
"MDEHOP, Mass deop's all chanhalf-ops in the current channel (needs chanop)" = "MDEHOP, poistaa opit kaikilta nykyisen kanavan puoliopeilta (vaatii opit)";

/* nothing */
"MDEOP, Mass deop's all chanops in the current channel (needs chanop)" = "MDEOP, poistaa opit kaikilta nykyisen kanavan opeilta (vaatii opit)";

/* nothing */
"ME <action>, sends the action to the current channel (actions are written in the 3rd person, like /me jumps)" = "ME <toiminta>, lähettää toiminnan nykyiselle kanavalle (toiminnat kirjoitetaan kolmannessa persoonassa, kuten /me hyppää)";

/* nothing */
"MKICK, Mass kicks everyone except you in the current channel (needs chanop)" = "MKICK, potkaisee kaikki muut kanavalta (vaatii opit)";

/* nothing */
"MOP, Mass op's all users in the current channel (needs chanop)" = "MOP, antaa kanavaoperaattorin oikeudet kanavan kaikille käyttäjille (vaatii opit)";

/* nothing */
"MSG <nick> <message>, sends a private message" = "MSG <käyttäjä> <viesti>, lähettää yksityisviestin";

/* nothing */
"NAMES, Lists the nicks on the current channel" = "NAMES, luettelee nykyisellä kanavalla olevat käyttäjät";

/* nothing */
"NCTCP <nick> <message>, Sends a CTCP notice" = "NCTCP <käyttäjä> <viesti>, lähettää CTCP-tiedotteen";

/* nothing */
"NEWSERVER [-noconnect] <hostname> [<port>]" = "NEWSERVER [-noconnect] <isäntä> [<portti>]";

/* nothing */
"NICK <nickname>, sets your nick" = "NICK <kutsumanimi>, asettaa oman kutsumanimesi";

/* nothing */
"NOTICE <nick/channel> <message>, sends a notice. Notices are a type of message that should be auto reacted to" = "NOTICE <käyttäjä/kanava> <viesti>, lähettää tiedotteen. Tiedotteet ovat viestejä, joihin tulee reagoida automaattisesti";

/* nothing */
"NOTIFY [-n network1[,network2,...]] [<nick>], displays your notify list or adds someone to it" = "NOTIFY [-n verkko1[,verkko2]] [<kutsumanimi>], näyttää ilmoitusluettelon tai lisää siihen jonkun";

/* nothing */
"OP <nick>, gives chanop status to the nick (needs chanop)" = "OP <käyttäjä>, antaa kanavaoperaattorin oikeudet käyttäjälle (vaatii opit)";

/* nothing */
"PART [<channel>] [<reason>], leaves the channel, by default the current one" = "PART [<kanava>] [<syy>], poistuu kanavalta, oletuksena nykyiseltä";

/* nothing */
"PING <nick | channel>, CTCP pings nick or channel" = "PING <käyttäjä | kanava>, CTCP-pingaa käyttäjää tai kanavaa";

/* nothing */
"QUERY [-nofocus] <nick>, opens up a new privmsg window to someone" = "QUERY [-nofocus] <käyttäjä>, avaa uuden ikkunan kahdenkeskistä keskustelua varten";

/* nothing */
"QUIT [<reason>], disconnects from the current server" = "QUIT [<syy>], katkaisee yhteyden nykyiseen palvelimeen";

/* nothing */
"QUOTE <text>, sends the text in raw form to the server" = "QUOTE <teksti>, lähettää tekstin raa'assa muodossa palvelimelle";

/* nothing */
"RECONNECT [-ssl] [<host>] [<port>] [<password>], Can be called just as /RECONNECT to reconnect to the current server or with /RECONNECT ALL to reconnect to all the open servers" = "RECONNECT [-ssl] [<isäntä>] [<portti>] [<salasana>], voidaan kutsua /RECONNECT nykyiseen palvelimeen uudelleen yhdistämiseksi, tai /RECONNECT ALL kaikkiin avoimiin palvelimiin uudelleen yhdistämiseksi";

/* nothing */
"RECONNECT [<host>] [<port>] [<password>], Can be called just as /RECONNECT to reconnect to the current server or with /RECONNECT ALL to reconnect to all the open servers" = "RECONNECT [<isäntä>] [<portti>] [<salasana>], voidaan kutsua /RECONNECT nykyiseen palvelimeen uudelleen yhdistämiseksi, tai /RECONNECT ALL kaikkiin avoimiin palvelimiin uudelleen yhdistämiseksi";

/* nothing */
"RECV <text>, send raw data to xchat, as if it was received from the irc server" = "RECV <teksti>, lähetä raakaa dataa xchatille, aivan kuin se olisi vastaanotettu irc-palvelimelta";

/* nothing */
"SAY <text>, sends the text to the object in the current window" = "SAY <teksti>, lähettää tekstin nykyisen ikkunan kanavalle/henkilölle";

/* nothing */
"SEND <nick> [<file>]" = "SEND <käyttäjä> [<tiedosto>], lähettää käyttäjälle tiedoston";

/* nothing */
"SERVCHAN [-ssl] <host> <port> <channel>, connects and joins a channel" = "SERVCHAN [-ssl] <isäntä> <portti> <kanava>, yhdistää ja liittyy kanavalle";

/* nothing */
"SERVCHAN <host> <port> <channel>, connects and joins a channel" = "SERVCHAN <isäntä> <portti> <kanava>, yhdistää ja liittyy kanavalle";

/* nothing */
"SERVER [-ssl] <host> [<port>] [<password>], connects to a server, the default port is 6667 for normal connections, and 9999 for ssl connections" = "SERVER [-ssl] <isäntä> [<portti>] [<salasana>], yhdistää palvelimelle, oletusportti on 6667 tavanomaisille yhteyksille, 9999 ssl-yhteyksille";

/* nothing */
"SERVER <host> [<port>] [<password>], connects to a server, the default port is 6667" = "SERVER <isäntä> [<portti>] [<salasana>], yhdistää palvelimelle, oletusportti on 6667";

/* nothing */
"SET [-e] [-or] [-quiet] <variable> [<value>]" = "SET [-e] [-or] [-quiet] <muuttuja> [<arvo>], asettaa muuttujan arvon.";

/* nothing */
"SETCURSOR [-|+]<position>" = "SETCURSOR [-|+]<paikka>, asettaa kursorin haluttuun paikkaan.";

/* nothing */
"TOPIC [<topic>], sets the topic if one is given, else shows the current topic" = "TOPIC [<aihe>], asettaa aiheen, jos se annetaan, muutoin näyttää nykyisen aiheen";

/* nothing */
"\nTRAY -f <timeout> <file1> [<file2>] Blink tray between two icons.\nTRAY -f <filename>                  Set tray to a fixed icon.\nTRAY -i <number>                    Blink tray with an internal icon.\nTRAY -t <text>                      Set the tray tooltip.\nTRAY -b <title> <text>              Set the tray balloon." = "\nTRAY -f <aika> <tied1> [<tied2>] Vuorottelee kahta kuvaketta ilmoitusalueella (välkyttää).\nTRAY -f <tiedostonimi>           Muuttumaton kuvake ilmoitusalueelle.\nTRAY -i <numero>                 Välkyttää sisäänrakennettua kuvaketta.\nTRAY -t <teksti>                 Asettaa ilmoitusalueen vihjetekstin.\nTRAY -b <otsikko> <teksti>       Asettaa ilmoitusalueen puhekuplan tekstin.";

/* nothing */
"UNBAN <mask> [<mask>...], unbans the specified masks." = "UNBAN <peite> [<peite>...], poistaa annettujen peitteiden bannin.";

/* nothing */
"UNIGNORE <mask> [QUIET]" = "UNIGNORE <peite> [QUIET]";

/* nothing */
"UNLOAD <name>, unloads a plugin or script" = "UNLOAD <nimi>, poistaa käytöstä liitännäisen tai skriptin";

/* nothing */
"URL <url>, opens a URL in your browser" = "URL <url>, avaa URLin selaimeen";

/* nothing */
"USELECT [-a] [-s] <nick1> <nick2> etc, highlights nick(s) in channel userlist" = "USELECT [-a] [-s] <nimi1> <nimi2> jne., valitsee nimet kanavan käyttäjäluettelosta";

/* nothing */
"VOICE <nick>, gives voice status to someone (needs chanop)" = "VOICE <käyttäjä>, antaa puheoikeuden käyttäjälle (vaatii opit)";

/* nothing */
"WALLCHAN <message>, writes the message to all channels" = "WALLCHAN <viesti>, kirjoittaa viestin kaikille kanaville";

/* nothing */
"WALLCHOP <message>, sends the message to all chanops on the current channel" = "WALLCHOP <viesti>, lähettää viestin kaikille nykyisen kanavan opeille";

/* nothing */
"Usage: %s\n" = "Käyttö: %s\n";

/* nothing */
"\nNo help available on that command.\n" = "\nKomennolle ei ole saatavissa ohjetta.\n";

/* nothing */
"No such command.\n" = "Komentoa ei ole.\n";

/* nothing */
"Bad arguments for user command.\n" = "Virheelliset argumentit käyttäjäkomennolle.\n";

/* nothing */
"Too many recursive usercommands, aborting." = "Liian monta rekursiivista käyttäjäkomentoa, keskeytetään.";

/* nothing */
"Unknown Command. Try /help\n" = "Tuntematon komento. Kokeile komentoa /help\n";

/* nothing */
"No xchat_plugin_init symbol; is this really an xchat plugin?" = "Symbolia xchat_plugin_init ei ole; onko tämä todella xchat-liitännäinen?";

/* nothing */
"Are you sure this is a SSL capable server and port?\n" = "Onko tämä varmasti SSL:ää tukeva palvelin ja portti?\n";

/* nothing */
"Cannot resolve hostname %s\nCheck your IP Settings!\n" = "Isäntänimen %s selvitys ei onnistu\nTarkista IP-asetukset!\n";

/* nothing */
"Proxy traversal failed.\n" = "Välipalvelimen kauttakulku epäonnistui.\n";

/* nothing */
"Cycling to next server in %s...\n" = "Siirrytään seuraavalle %s-verkon palvelimelle...\n";

/* nothing */
"Warning: \"%s\" character set is unknown. No conversion will be applied for network %s." = "Varoitus: merkistö \"%s\" on tuntematon. Verkossa %s ei käytetä mitään muunnosta.";

/* nothing */
"%C22*%O$t$1 added to notify list." = "%C22*%O$t$1 lisättiin ilmoitusluetteloon.";

/* nothing */
"%C22*%O$t$1 Banlist:%C19 $4%C20 $2%C21 $3" = "%C22*%O$t$1 Banniluettelo: %C19$4 %C20$2 %C21$3";

/* nothing */
"%C22*%O$tCannot join%C26 %B$1 %O(You are banned)." = "%C22*%O$tEi voi liittyä kanavalle %C26%B$1%O (sinut on bannattu).";

/* nothing */
"%C22*%O$t$1 is now known as $2" = "%C22*%O$t%C26$1%O tunnetaan nyt nimellä %C26$2%O.";

/* nothing */
"%C22*%O$t$1 sets ban on $2" = "%C22*%O$t$1 asettaa bannin $2";

/* nothing */
"%C22*%O$tChannel $1 created on $2" = "%C22*%O$tKanava $1 luotu $2";

/* nothing */
"%C22*%O$t%C26$1%O removes channel half-operator status from%C26 $2" = "%C22*%O$t%C26$1%O poistaa puolioperaattorin oikeudet käyttäjältä %C26$2%O.";

/* nothing */
"%C22*%O$t%C26$1%O removes channel operator status from%C26 $2" = "%C22*%O$t%C26$1%O poistaa kanavaoperaattorin oikeudet käyttäjältä %C26$2%O.";

/* nothing */
"%C22*%O$t%C26$1%O removes voice from%C26 $2" = "%C22*%O$t%C26$1%O poistaa puheoikeuden käyttäjältä %C26$2%O.";

/* nothing */
"%C22*%O$t$1 sets exempt on $2" = "%C22*%O$t$1 asettaa erivapauden $2.";

/* nothing */
"%C22*%O$t%C26$1%O gives channel half-operator status to%C26 $2" = "%C22*%O$t%C26$1%O antaa puolioperaattorin oikeudet käyttäjälle %C26$2%O.";

/* nothing */
"%C22*%O$t$1 sets invite on $2" = "%C22*%O$t%C26$1%O asettaa kutsun käyttäjälle %C26$2%O.";

/* nothing */
"%UChannel          Users   Topic" = "%UKanava           Käyttäjät Aihe%O";

/* nothing */
"%C22*%O$t$1 sets mode $2$3 $4" = "%C22*%O$t%C26$1%O asettaa tilan $2$3 $4";

/* nothing */
"%C22*%O$t%C22Channel $1 modes: $2" = "%C22*%O$t%C22Kanavan $1 tilat: $2";

/* nothing */
"%C22*%O$t%C26$1%O gives channel operator status to%C26 $2" = "%C22*%O$t%C26$1%O antaa kanavaoperaattorin oikeudet käyttäjälle %C26$2%O.";

/* nothing */
"%C22*%O$t$1 removes exempt on $2" = "%C22*%O$t%C26$1%O poistaa erivapauden $2.";

/* nothing */
"%C22*%O$t$1 removes invite on $2" = "%C22*%O$t%C26$1%O poistaa kutsun $2.";

/* nothing */
"%C22*%O$t$1 removes channel keyword" = "%C22*%O$t%C26$1%O poistaa kanavan tunnussanan.";

/* nothing */
"%C22*%O$t$1 removes user limit" = "%C22*%O$t%C26$1%O poistaa käyttäjärajan.";

/* nothing */
"%C22*%O$t$1 sets channel keyword to $2" = "%C22*%O$t%C26$1%O asettaa kanavan tunnussanaksi %C26$2%O.";

/* nothing */
"%C22*%O$t$1 sets channel limit to $2" = "%C22*%O$t%C26$1%O asettaa kanavan käyttäjärajaksi $2.";

/* nothing */
"%C22*%O$t$1 removes ban on $2" = "%C22*%O$t%C26$1%O poistaa bannin $2.";

/* nothing */
"%C22*%O$t%C26$1%O gives voice to%C26 $2" = "%C22*%O$t%C26$1%O antaa puheoikeuden käyttäjälle %C26$2%O.";

/* nothing */
"%C22*%O$t%C22Connected. Now logging in..." = "%C22*%O$t%C22Yhdistetty. Kirjaudutaan sisään...";

/* nothing */
"%C22*%O$t%C22Connecting to $1 ($2) port $3%O..." = "%C22*%O$t%C22Yhdistetään palvelimelle $1 ($2) porttiin $3%O...";

/* nothing */
"%C21*%O$t%C21Connection failed. Error: $1" = "%C21*%O$t%C21Yhdistäminen epäonnistui. Virhe: $1";

/* nothing */
"%C22*%O$tReceived a CTCP $1 from $2" = "%C22*%O$tVastaanotettiin CTCP $1 käyttäjältä $2.";

/* nothing */
"%C22*%O$tReceived a CTCP $1 from $2 (to $3)" = "%C22*%O$tVastaanotettiin CTCP $1 käyttäjältä $2 (kanavalle $3).";

/* nothing */
"%C19>%O$1%C19<%O$tCTCP $2" = "%C19>%O$1%C19<%O$tCTCP $2";

/* nothing */
"%C22*%O$tReceived a CTCP Sound $1 from $2" = "%C22*%O$tVastaanotettiin CTCP-ääni $1 käyttäjältä $2.";

/* nothing */
"%C22*%O$tReceived a CTCP Sound $1 from $2 (to $3)" = "%C22*%O$tVastaanotettiin CTCP-ääni $1 käyttäjältä $2 (kanavalle $3).";

/* nothing */
"%C22*%O$tDCC CHAT to %C26$1%O aborted." = "%C22*%O$tDCC-keskustelu käyttäjän %C26$1%O kanssa keskeytetty.";

/* nothing */
"%C22*%O$tDCC CHAT connection established to %C26$1 %C30[%O$2%C30]" = "%C22*%O$tDCC-keskustelu avattu käyttäjän %C26$1%O kanssa. %C14[%O$2%C14]%O";

/* nothing */
"%C22*%O$tDCC CHAT to %C26$1%O lost ($4)." = "%C22*%O$tDCC-keskustelu käyttäjän %C26$1%O kanssa katkesi. ($4.)";

/* nothing */
"%C22*%O$tReceived a DCC CHAT offer from $1" = "%C22*%O$tKäyttäjä %C26$1%O ehdottaa DCC-keskustelua.";

/* nothing */
"%C22*%O$tOffering DCC CHAT to $1" = "%C22*%O$tEhdotetaan DCC-keskustelua käyttäjälle %C26$1%O.";

/* nothing */
"%C22*%O$tAlready offering CHAT to $1" = "%C22*%O$tDCC-keskustelua on jo ehdotettu käyttäjälle %C26$1%O.";

/* nothing */
"%C22*%O$tDCC $1 connect attempt to%C26 $2%O failed (err=$3)." = "%C22*%O$tDCC $1 -yhteyttä ei saatu käyttäjään %C26$2%O (virhe=$3).";

/* nothing */
"%C22*%O$tReceived '$1%O' from $2" = "%C22*%O$tVastaanotettiin \"$1%O\" käyttäjältä %C26$2%O.";

/* nothing */
"%C24,18 Type  To/From    Status  Size    Pos     File         " = "%C24,18Tyyppi Vastapää   Tila    Koko    Paikka  Tiedosto     ";

/* nothing */
"%C22*%O$tReceived a malformed DCC request from %C26$1%O.%010%C22*%O$tContents of packet: $2" = "%C22*%O$tKäyttäjä %C26$1%O lähetti epäkelvon DCC-pyynnön.%010%C22*%O$tPaketin sisältö: $2";

/* nothing */
"%C22*%O$tOffering%C26 $1%O to%C26 $2" = "%C22*%O$tTarjotaan tiedostoa %C26$1%O käyttäjälle %C26$2%O.";

/* nothing */
"%C22*%O$tNo such DCC offer." = "%C22*%O$tTuollaista DCC-lähetystä ei ole tarjottu.";

/* nothing */
"%C22*%O$tDCC RECV%C26 $2%O to%C26 $1%O aborted." = "%C22*%O$tDCC RECV %C26$2%O käyttäjältä %C26$1%O keskeytetty.";

/* nothing */
"%C22*%O$tDCC RECV%C26 $1%O from%C26 $3%O complete %C30[%C26$4%O cps%C30]%O." = "%C22*%O$tDCC RECV %C26$1%O käyttäjältä %C26$3%O valmis %C30[%C26$4%O t/s%C30]%O.";

/* nothing */
"%C22*%O$tDCC RECV connection established to%C26 $1 %C30[%O$2%C30]" = "%C22*%O$tDCC RECV -yhteys muodostettu käyttäjään %C26$1 %C30[%O$2%C30]%O.";

/* nothing */
"%C22*%O$tDCC RECV%C26 $1%O from%C26 $3%O failed ($4)." = "%C22*%O$tDCC RECV %C26$1%O käyttäjältä %C26$3%O epäonnistui. ($4.)";

/* nothing */
"%C22*%O$tDCC RECV: Cannot open $1 for writing ($2)." = "%C22*%O$tDCC RECV: Tiedostoon %C26$1%O ei voi kirjoittaa ($2).";

/* nothing */
"%C22*%O$tThe file%C26 $1%C already exists, saving it as%C26 $2%O instead." = "%C22*%O$tTiedosto %C26$1%O on jo olemassa, joten tallenetaan nimellä %C26$2%O.";

/* nothing */
"%C22*%O$t%C26$1 %Ohas requested to resume%C26 $2 %Cfrom%C26 $3%C." = "%C22*%O$t%C26$1%O pyytää jatkamaan tiedoston %C26$2%O siirtoa kohdasta %C26$3%O.";

/* nothing */
"%C22*%O$tDCC SEND%C26 $2%O to%C26 $1%O aborted." = "%C22*%O$tDCC SEND %C26$2%O käyttäjälle %C26$1%O keskeytetty.";

/* nothing */
"%C22*%O$tDCC SEND%C26 $1%O to%C26 $2%O complete %C30[%C26$3%O cps%C30]%O." = "%C22*%O$tDCC SEND %C26$1%O käyttäjälle %C26$2%O valmis %C30[%C26$3%O t/s%C30]%O.";

/* nothing */
"%C22*%O$tDCC SEND connection established to%C26 $1 %C30[%O$2%C30]" = "%C22*%O$tDCC SEND -yhteys muodostettu käyttäjään %C26$1 %C30[%O$2%C30]%O.";

/* nothing */
"%C22*%O$tDCC SEND%C26 $1%O to%C26 $2%O failed. $3" = "%C22*%O$tDCC SEND %C26$1%O käyttäjälle %C26$2%O epäonnistui. $3";

/* nothing */
"%C22*%O$t%C26$1 %Ohas offered%C26 $2 %O(%C26$3 %Obytes)" = "%C22*%O$t%C26$1%O tarjoaa tiedostoa %C26$2%O (%C26$3%O tavua).";

/* nothing */
"%C22*%O$tDCC $1%C26 $2 %Oto%C26 $3 %Cstalled - aborting." = "%C22*%O$tDCC $1 %C26$2%O käyttäjälle %C26$3%O pysähtynyt - keskeytetään.";

/* nothing */
"%C22*%O$tDCC $1%C26 $2 %Oto%C26 $3 %Otimed out - aborting." = "%C22*%O$tDCC $1 %C26$2%O käyttäjälle %C26$3%O aikakatkaistu - keskeytetään.";

/* nothing */
"%C22*%O$t$1 deleted from notify list." = "%C22*%O$t$1 poistettu ilmoitusluettelosta.";

/* nothing */
"%C22*%O$tDisconnected ($1)." = "%C22*%O$tYhteys katkaistu ($1).";

/* nothing */
"%C22*%O$tFound your IP: [$1]" = "%C22*%O$tOma IP löytyi: [$1]";

/* nothing */
"%O%C26$1%O added to ignore list." = "%O%C26$1%O lisätty huomioimattomuusluetteloon.";

/* nothing */
"Ignore on %C26$1%O changed." = "Huomioimattomuutta %C26$1%O muutettu.";

/* nothing */
"%C24,18                                                              " = "%C24,28                                                              ";

/* nothing */
"%C24,18 Hostmask                  PRIV NOTI CHAN CTCP DCC  INVI UNIG " = "%C24,18 Isännän peite             PRIV NOTI CHAN CTCP DCC  INVI UNIG ";

/* nothing */
"%O%C26$1%O removed from ignore list." = "%O%C26$1%O poistettu huomioimattomuusluettelosta.";

/* nothing */
"  Ignore list is empty." = "  Huomioimattomuusluettelo on tyhjä.";

/* nothing */
"%C22*%O$tCannot join%C26 %B$1 %O(Channel is invite only)." = "%C22*%O$tKanavalle %C26%B$1%O ei voi liittyä (vain kutsutuille).";

/* nothing */
"%C22*%O$tYou have been invited to%C26 $1%O by%C26 $2%C (%C26$3%C)" = "%C22*%O$t%C26$2%O kutsuu sinut kanavalle %C26$1%O (%C26$3%O)";

/* nothing */
"%C19*%O$t%C19%B$1 %B($3) has joined $2" = "%C19*%O$t%C19%B$1%B ($3) liittyi kanavalle $2.";

/* nothing */
"%C22*%O$tCannot join%C26 %B$1 %O(Requires keyword)." = "%C22*%O$tKanavalle %C26%B$1%O ei voi liittyä (vaatii tunnussanan).";

/* nothing */
"%C21*%O$t%C21$1 has kicked $2 from $3 ($4%O%C21)" = "%C21*%O$t%C21$1 potkaisi käyttäjän $2 kanavalta $3 ($4%O%C21).";

/* nothing */
"%C22*%O$tYou have been killed by $1 ($2%O%C22)" = "%C22*%O$t$1 ($2%O) tappoi sinut.";

/* nothing */
"%C22*%O$t%C22MOTD Skipped." = "%C22*%O$t%C22MOTD ohitettu.";

/* nothing */
"%C22*%O$t$1 already in use. Retrying with $2..." = "%C22*%O$t$1 on jo käytössä. Kokeillaan kutsumanimeä $2...";

/* nothing */
"%C22*%O$tNickname already in use. Use /NICK to try another." = "%C22*%O$tKutsumanimi on jo käytössä. Kokeile jotain muuta komennolla /NICK.";

/* nothing */
"%C22*%O$tNo such DCC." = "%C22*%O$tTuollaista DCC:tä ei ole.";

/* nothing */
"%C22*%O$tNo process is currently running" = "%C22*%O$tProsesseja ei ole käynnissä.";

/* nothing */
"$tNotify list is empty." = "$tIlmoitusluettelo on tyhjä.";

/* nothing */
"%C24,18 %B  Notify List                           " = "%C24,18 %B  Ilmoitusluettelo                      ";

/* nothing */
"%C22*%O$t$1 users in notify list." = "%C22*%O$tIlmoitusluettelossa on $1 käyttäjä(ä).";

/* nothing */
"%C22*%O$tNotify: $1 is offline ($3)." = "%C22*%O$tIlmoitus: $1 on tavoittamattomissa ($3).";

/* nothing */
"%C22*%O$tNotify: $1 is online ($3)." = "%C22*%O$tIlmoitus: $1 on tavoitettavissa ($3).";

/* nothing */
"%C23*%O$t%C23$1 (%O%C23$2) has left $3" = "%C23*%O$t%C23$1 ($2) poistui kanavalta $3.";

/* nothing */
"%C23*%O$t%C23$1 (%O%C23$2) has left $3 (%O%C23%B%B$4%O%C23)" = "%C23*%O$t%C23$1%O%C23 ($2) poistui kanavalta $3%O%C23 (%B%B$4%O%C23)";

/* nothing */
"%C22*%O$tPing reply from $1: $2 second(s)" = "%C22*%O$tPing-vastaus käyttäjältä $1: $2 sekunti(a).";

/* nothing */
"%C22*%O$tNo ping reply for $1 seconds, disconnecting." = "%C22*%O$tPingiin ei ole vastattu $1 sekuntiin, katkaistaan yhteys.";

/* nothing */
"%C22*%O$tA process is already running" = "%C22*%O$tProsessi on jo käynnissä.";

/* nothing */
"%C23*%O$t%C23$1 has quit (%O%C23%B%B$2%O%C23)" = "%C23*%O$t%C23$1 lopetti ($2%O%C23).";

/* nothing */
"%C22*%O$t$1 sets modes%B %C30[%O$2%B%C30]" = "%C22*%O$t$1 asettaa tilat %B%C30[%O$2%B%C30].";

/* nothing */
"%C28-%C29$1/Wallops%C28-%O$t$2" = "%C28-%C29$1/Wallops%C28-%O$t$2";

/* nothing */
"%C22*%O$tLooking up IP number for%C26 $1%O..." = "%C22*%O$tEtsitään IP-osoitetta nimelle %C26$1%O...";

/* nothing */
"%C22*%O$t%C22Connected." = "%C22*%O$tYhdistetty.";

/* nothing */
"%C22*%O$t%C22Looking up $1" = "%C22*%O$tEtsitään osoitetta %C26$1%C...";

/* nothing */
"%C22*%O$tStopped previous connection attempt (pid=$1)" = "%C22*%O$tPysäytettiin edellinen yhteysyritys (pid=$1)";

/* nothing */
"%C29*%O$t%C29Topic for $1%C %C29is: $2" = "%C29*%O$t%C29Kanavan $1%C %C29aihe on: $2";

/* nothing */
"%C22*%O$t$1 has changed the topic to: $2" = "%C22*%O$t$1 vaihtoi aiheeksi: $2";

/* nothing */
"%C29*%O$t%C29Topic for $1%C %C29set by $2%C %C29at $3" = "%C29*%O$t%C29Aiheen kanavalle $1%C %C29on asettanut $2%C %C29$3.";

/* nothing */
"%C22*%O$tUnknown host. Maybe you misspelled it?" = "%C22*%O$tTuntematon isäntä. Onkohan se kirjoitettu väärin?";

/* nothing */
"%C22*%O$tCannot join%C26 %B$1 %O(User limit reached)." = "%C22*%O$tKanavalle %C26%B$1%O ei voi liittyä (Käyttäjäraja saavutettu).";

/* nothing */
"%C22*%O$t%C26Users on $1:%C $2" = "%C22*%O$t%C26Käyttäjät kanavalla $1:%C $2";

/* nothing */
"%C22*%O$t%C28[%O$1%C28] %O$2%C27 $3" = "%C22*%O$t%C28[%O$1%C28]%O $2 %C27$3";

/* nothing */
"%C22*%O$t%C28[%O$1%C28] %Cis away %C30(%O$2%O%C30)" = "%C22*%O$t%C28[%O$1%C28]%C on poissa %C30(%O$2%O%C30)";

/* nothing */
"%C22*%O$t%C28[%O$1%C28]%O $2" = "%C22*%O$t%C28[%O$1%C28]%O $2";

/* nothing */
"%C22*%O$t%C28[%O$1%C28] %OEnd of WHOIS list." = "%C22*%O$t%C28[%O$1%C28]%O WHOIS-luettelon loppu.";

/* nothing */
"%C22*%O$t%C28[%O$1%C28]%O idle%C26 $2" = "%C22*%O$t%C28[%O$1%C28]%O jouten %C26$2";

/* nothing */
"%C22*%O$t%C28[%O$1%C28]%O idle%C26 $2%O, signon:%C26 $3" = "%C22*%O$t%C28[%O$1%C28]%O jouten %C26$2%O, kirjautunut: %C26$3";

/* nothing */
"%C22*%O$t%C28[%O$1%C28] %C30(%O$2@$3%C30)%O: $4" = "%C22*%O$t%C28[%O$1%C28] %C30(%O$2@$3%C30)%O: $4";

/* nothing */
"%C22*%O$t%C28[%O$1%C28] %Oreal user@host%C27 $2%O, real IP%C27 $3" = "%C22*%O$t%C28[%O$1%C28]%O todellinen käyttäjä@isäntä %C27$2%O, todellinen IP %C27$3.";

/* nothing */
"%C19*%O$t%C19Now talking on $2" = "%C19*%O$t%C19Puhut nyt kanavalla $2.";

/* nothing */
"%C23*$tYou have been kicked from $2 by $3 ($4%O%C23)" = "%C23*$t$3 potkaisi sinut kanavalta $2 ($4%O%C23).";

/* nothing */
"%C23*$tYou have left channel $3" = "%C23*$tPoistuit kanavalta $3.";

/* nothing */
"%C23*$tYou have left channel $3 (%O%C23%B%B$4%O%C23)" = "%C23*$tPoistuit kanavalta $3%O%C23 ($4%O%C23).";

/* nothing */
"%C22*%O$tYou've invited%C26 $1%O to%C26 $2%O (%C26$3%O)" = "%C22*%O$tKutsut käyttäjää %C26$1%O kanavalle %C26$2%O (%C26$3%O).";

/* nothing */
"%C22*%O$tYou are now known as $2" = "%C22*%O$tKutsumanimesi on nyt $2.";

/* nothing */
"Loaded log from" = "Loki luettiin tiedostosta";

/* nothing */
"**** ENDING LOGGING AT %s\n" = "**** LOKIKIRJOITUS LOPPUU %s\n";

/* nothing */
"**** BEGIN LOGGING AT %s\n" = "**** LOKIKIRJOITUS ALKAA %s\n";

/* nothing */
"* Can't open log file(s) for writing. Check the\n  permissions on %s/xchatlogs" = "* Lokitiedosto(j)a ei voi avata kirjoitusta varten.\n  Tarkista oikeudet hakemistossa %s/xchatlogs";

/* nothing */
"Left message" = "Vasen viesti";

/* nothing */
"Right message" = "Oikea viesti";

/* nothing */
"The nick of the joining person" = "Liittyvän henkilön kutsumanimi";

/* nothing */
"The channel being joined" = "Kanava, jolle liitytään";

/* nothing */
"The host of the person" = "Henkilön isäntänimi";

/* nothing */
"Nickname" = "Kutsumanimi";

/* nothing */
"The action" = "Toiminto";

/* nothing */
"Mode char" = "Tilamerkki";

/* nothing */
"The text" = "Teksti";

/* nothing */
"Identified text" = "Korostettava teksti";

/* nothing */
"The message" = "Viesti";

/* nothing */
"Old nickname" = "Vanha kutsumanimi";

/* nothing */
"New nickname" = "Uusi kutsumanimi";

/* nothing */
"Nick of person who changed the topic" = "Aihetta muuttaneen henkilön kutsumanimi";

/* nothing */
"Topic" = "Aihe";

/* nothing */
"Channel" = "Kanava";

/* nothing */
"The nickname of the kicker" = "Potkaisijan kutsumanimi";

/* nothing */
"The person being kicked" = "Potkaistava henkilö";

/* nothing */
"The channel" = "Kanava";

/* nothing */
"The reason" = "Syy";

/* nothing */
"The nick of the person leaving" = "Poistuvan henkilön kutsumanimi";

/* nothing */
"The time" = "Aika";

/* nothing */
"The creator" = "Luoja";

/* nothing */
"Nick" = "Kutsumanimi";

/* nothing */
"Reason" = "Syy";

/* nothing */
"Host" = "Isäntä";

/* nothing */
"Who it's from" = "Keneltä se on";

/* nothing */
"The time in x.x format (see below)" = "Aika x.x-muodossa (katso alta)";

/* nothing */
"The Channel it's going to" = "Kanava, jolle se on menossa";

/* nothing */
"The sound" = "Ääni";

/* nothing */
"The nick of the person" = "Henkilön kutsumanimi";

/* nothing */
"The CTCP event" = "CTCP-tapahtuma";

/* nothing */
"The nick of the person who set the key" = "Tunnussanan asettaneen henkilön kutsumanimi";

/* nothing */
"The key" = "Tunnussana";

/* nothing */
"The nick of the person who set the limit" = "Rajan asettaneen henkilön kutsumanimi";

/* nothing */
"The limit" = "Raja";

/* nothing */
"The nick of the person who did the op'ing" = "Opit antaneen henkilön kutsumanimi";

/* nothing */
"The nick of the person who has been op'ed" = "Opit saaneen henkilön kutsumanimi";

/* nothing */
"The nick of the person who has been halfop'ed" = "Puoliopit saaneen henkilön kutsumanimi";

/* nothing */
"The nick of the person who did the halfop'ing" = "Puoliopit antaneen henkilön kutsumanimi";

/* nothing */
"The nick of the person who did the voice'ing" = "Puheoikeuden antaneen henkilön kutsumanimi";

/* nothing */
"The nick of the person who has been voice'ed" = "Puheoikeuden saaneen henkilön kutsumanimi";

/* nothing */
"The nick of the person who did the banning" = "Bannin asettajan kutsumanimi";

/* nothing */
"The ban mask" = "Bannipeite";

/* nothing */
"The nick who removed the key" = "Tunnussanan poistajan kutsumanimi";

/* nothing */
"The nick who removed the limit" = "Rajan poistajan kutsumanimi";

/* nothing */
"The nick of the person of did the deop'ing" = "Opit poistaneen henkilön kutsumanimi";

/* nothing */
"The nick of the person who has been deop'ed" = "Opit menettäneen henkilön kutsumanimi";

/* nothing */
"The nick of the person of did the dehalfop'ing" = "Puoliopit menettäneen henkilön kutsumanimi";

/* nothing */
"The nick of the person who has been dehalfop'ed" = "Puoliopit poistaneen henkilön kutsumanimi";

/* nothing */
"The nick of the person of did the devoice'ing" = "Puheoikeuden poistaneen henkilön kutsumanimi";

/* nothing */
"The nick of the person who has been devoice'ed" = "Puheoikeuden menettäneen henkilön kutsumanimi";

/* nothing */
"The nick of the person of did the unban'ing" = "Bannin poistaneen henkilön kutsumanimi";

/* nothing */
"The nick of the person who did the exempt" = "Erivapauden asettaneen henkilön kutsumanimi";

/* nothing */
"The exempt mask" = "Erivapauspeite";

/* nothing */
"The nick of the person removed the exempt" = "Erivapauden poistaneen henkilön kutsumanimi";

/* nothing */
"The nick of the person who did the invite" = "Kutsun esittäneen henkilön kutsumanimi";

/* nothing */
"The invite mask" = "Kutsupeite";

/* nothing */
"The nick of the person removed the invite" = "Kutsun poistaneen henkilön kutsumanimi";

/* nothing */
"The nick of the person setting the mode" = "Tilan asettaneen henkilön kutsumanimi";

/* nothing */
"The mode's sign (+/-)" = "Tilan etumerkki (+/-)";

/* nothing */
"The mode letter" = "Tilakirjain";

/* nothing */
"The channel it's being set on" = "Kanava, jolle se asetetaan";

/* nothing */
"Username" = "Käyttäjänimi";

/* nothing */
"Full name" = "Koko nimi";

/* nothing */
"Channel Membership/\"is an IRC operator\"" = "Kanavan jäsenyys/\"on IRC-operaattori\"";

/* nothing */
"Server Information" = "Palvelintiedot";

/* nothing */
"Idle time" = "Joutenoloaika";

/* nothing */
"Signon time" = "Kirjautumisaika";

/* nothing */
"Away reason" = "Poissaolon syy";

/* nothing */
"Message" = "Viesti";

/* nothing */
"Account" = "Tunnus";

/* nothing */
"Real user@host" = "Todellinen käyttäjä@isäntä";

/* nothing */
"Real IP" = "Todellinen IP";

/* nothing */
"Channel Name" = "Kanavanimi";

/* nothing */
"Text" = "Teksti";

/* nothing */
"Server Name" = "Palvelinnimi";

/* nothing */
"Nick of person who invited you" = "Sinut kutsuneen henkilön nimi";

/* nothing */
"Users" = "Käyttäjiä";

/* nothing */
"Nickname in use" = "Kutsumanimi on käytössä";

/* nothing */
"Nick being tried" = "Kokeiltava kutsumanimi";

/* nothing */
"IP" = "IP";

/* nothing */
"Port" = "Portti";

/* nothing */
"Network" = "Verkko";

/* nothing */
"Modes string" = "Tilamerkkijono";

/* nothing */
"IP address" = "IP-osoite";

/* nothing */
"DCC Type" = "DCC-tyyppi";

/* nothing */
"Filename" = "Tiedostonimi";

/* nothing */
"Destination filename" = "Kohdetiedostonimi";

/* nothing */
"CPS" = "t/s";

/* nothing */
"Pathname" = "Polku";

/* nothing */
"Position" = "Sijainti";

/* nothing */
"Size" = "Koko";

/* nothing */
"DCC String" = "DCC-merkkijono";

/* nothing */
"Number of notify items" = "Ilmoitusmerkintöjen määrä";

/* nothing */
"Old Filename" = "Vanha tiedostonimi";

/* nothing */
"New Filename" = "Uusi tiedostonimi";

/* nothing */
"Receiver" = "Vastaanottaja";

/* nothing */
"Hostmask" = "Isännän peite";

/* nothing */
"Hostname" = "Isäntänimi";

/* nothing */
"The Packet" = "Paketti";

/* nothing */
"Seconds" = "Sekuntia";

/* nothing */
"Nick of person who have been invited" = "Kutsutun henkilön kutsumanimi";

/* nothing */
"Banmask" = "Bannipeite";

/* nothing */
"Who set the ban" = "Kuka asetti bannin";

/* nothing */
"Ban time" = "Bannausaika";

/* nothing */
"Error parsing event %s.\nLoading default." = "Virhe tapahtuman %s jäsentämisessä.\nLadataan oletus";

/* nothing */
"Cannot read sound file:\n%s" = "Äänitiedostoa ei voi lukea:\n%s";

/* nothing */
"Remote host closed socket" = "Vastapää sulki pistokkeen";

/* nothing */
"Connection refused" = "Yhteys torjuttu";

/* nothing */
"No route to host" = "Ei reititystä isäntään";

/* nothing */
"Connection timed out" = "Yhteys aikakatkaistu";

/* nothing */
"Cannot assign that address" = "Osoitetta ei voi asettaa";

/* nothing */
"Connection reset by peer" = "Vastapää katkaisi yhteyden";

/* nothing */
"Ascension Island" = "Ascension Island";

/* nothing */
"Andorra" = "Andorra";

/* nothing */
"United Arab Emirates" = "Yhdistyneet Arabiemiraatit";

/* nothing */
"Afghanistan" = "Afganistan";

/* nothing */
"Antigua and Barbuda" = "Antigua ja Barbuda";

/* nothing */
"Anguilla" = "Anguilla";

/* nothing */
"Albania" = "Albania";

/* nothing */
"Armenia" = "Armenia";

/* nothing */
"Netherlands Antilles" = "Alankomaiden Antillit";

/* nothing */
"Angola" = "Angola";

/* nothing */
"Antarctica" = "Etelämanner";

/* nothing */
"Argentina" = "Argentiina";

/* nothing */
"Reverse DNS" = "Käänteisnimipalvelu";

/* nothing */
"American Samoa" = "Amerikan Samoa";

/* nothing */
"Austria" = "Itävalta";

/* nothing */
"Nato Fiel" = "NATO";

/* nothing */
"Australia" = "Australia";

/* nothing */
"Aruba" = "Aruba";

/* nothing */
"Aland Islands" = "Ahvenanmaa";

/* nothing */
"Azerbaijan" = "Azerbaidzan";

/* nothing */
"Bosnia and Herzegovina" = "Bosnia ja Herzegovina";

/* nothing */
"Barbados" = "Barbados";

/* nothing */
"Bangladesh" = "Bangladesh";

/* nothing */
"Belgium" = "Belgia";

/* nothing */
"Burkina Faso" = "Burkina Faso";

/* nothing */
"Bulgaria" = "Bulgaria";

/* nothing */
"Bahrain" = "Bahrain";

/* nothing */
"Burundi" = "Burundi";

/* nothing */
"Businesses" = "Liike-elämä";

/* nothing */
"Benin" = "Benin";

/* nothing */
"Bermuda" = "Bermuda";

/* nothing */
"Brunei Darussalam" = "Brunei";

/* nothing */
"Bolivia" = "Bolivia";

/* nothing */
"Brazil" = "Brasilia";

/* nothing */
"Bahamas" = "Bahamasaaret";

/* nothing */
"Bhutan" = "Bhutan";

/* nothing */
"Bouvet Island" = "Bouvet'n saari";

/* nothing */
"Botswana" = "Botswana";

/* nothing */
"Belarus" = "Valko-Venäjä";

/* nothing */
"Belize" = "Belize";

/* nothing */
"Canada" = "Kanada";

/* nothing */
"Cocos Islands" = "Kookossaaret";

/* nothing */
"Democratic Republic of Congo" = "Kongon demokraattinen tasavalta";

/* nothing */
"Central African Republic" = "Keski-Afrikan tasavalta";

/* nothing */
"Congo" = "Kongo";

/* nothing */
"Switzerland" = "Sveitsi";

/* nothing */
"Cote d'Ivoire" = "Norsunluurannikko";

/* nothing */
"Cook Islands" = "Cooksaaret";

/* nothing */
"Chile" = "Chile";

/* nothing */
"Cameroon" = "Kamerun";

/* nothing */
"China" = "Kiina";

/* nothing */
"Colombia" = "Kolumbia";

/* nothing */
"Internic Commercial" = "Kaupallinen";

/* nothing */
"Costa Rica" = "Costa Rica";

/* nothing */
"Serbia and Montenegro" = "Serbia ja Montenegro";

/* nothing */
"Cuba" = "Kuuba";

/* nothing */
"Cape Verde" = "Kap Verde";

/* nothing */
"Christmas Island" = "Joulusaari";

/* nothing */
"Cyprus" = "Kypros";

/* nothing */
"Czech Republic" = "Tšekinmaa";

/* nothing */
"Germany" = "Saksa";

/* nothing */
"Djibouti" = "Djibouti";

/* nothing */
"Denmark" = "Tanska";

/* nothing */
"Dominica" = "Dominica";

/* nothing */
"Dominican Republic" = "Dominikaaninen tasavalta";

/* nothing */
"Algeria" = "Algeria";

/* nothing */
"Ecuador" = "Ecuador";

/* nothing */
"Educational Institution" = "Koulutuksellinen laitos (Yhdysvallat)";

/* nothing */
"Estonia" = "Viro";

/* nothing */
"Egypt" = "Egypti";

/* nothing */
"Western Sahara" = "Länsi-Sahara";

/* nothing */
"Eritrea" = "Eritrea";

/* nothing */
"Spain" = "Espanja";

/* nothing */
"Ethiopia" = "Etiopia";

/* nothing */
"European Union" = "Euroopan unioni";

/* nothing */
"Finland" = "Suomi";

/* nothing */
"Fiji" = "Fidzi";

/* nothing */
"Falkland Islands" = "Falklandsaaret";

/* nothing */
"Micronesia" = "Mikronesia";

/* nothing */
"Faroe Islands" = "Färsaaret";

/* nothing */
"France" = "Ranska";

/* nothing */
"Gabon" = "Gabon";

/* nothing */
"Great Britain" = "Iso-Britannia";

/* nothing */
"Grenada" = "Grenada";

/* nothing */
"Georgia" = "Georgia";

/* nothing */
"French Guiana" = "Ranskan Guyana";

/* nothing */
"British Channel Isles" = "Englannin kanaalin saaret";

/* nothing */
"Ghana" = "Ghana";

/* nothing */
"Gibraltar" = "Gibraltar";

/* nothing */
"Greenland" = "Grönlanti";

/* nothing */
"Gambia" = "Gambia";

/* nothing */
"Guinea" = "Guinea";

/* nothing */
"Government" = "Valtio (Yhdysvallat)";

/* nothing */
"Guadeloupe" = "Guadeloupe";

/* nothing */
"Equatorial Guinea" = "Päiväntasaajan Guinea";

/* nothing */
"Greece" = "Kreikka";

/* nothing */
"S. Georgia and S. Sandwich Isles" = "Etelä-Georgia ja Eteläiset Sandwichsaaret";

/* nothing */
"Guatemala" = "Guatemala";

/* nothing */
"Guam" = "Guam";

/* nothing */
"Guinea-Bissau" = "Guinea-Bissau";

/* nothing */
"Guyana" = "Guyana";

/* nothing */
"Hong Kong" = "Hongkong";

/* nothing */
"Heard and McDonald Islands" = "Heard ja McDonaldinsaaret";

/* nothing */
"Honduras" = "Honduras";

/* nothing */
"Croatia" = "Kroatia";

/* nothing */
"Haiti" = "Haiti";

/* nothing */
"Hungary" = "Unkari";

/* nothing */
"Indonesia" = "Indonesia";

/* nothing */
"Ireland" = "Irlanti";

/* nothing */
"Israel" = "Israel";

/* nothing */
"Isle of Man" = "Mansaari";

/* nothing */
"India" = "Intia";

/* nothing */
"Informational" = "Tiedotuksellinen";

/* nothing */
"International" = "Kansainvälinen";

/* nothing */
"British Indian Ocean Territory" = "Brittiläinen Intian valtameren alue";

/* nothing */
"Iraq" = "Irak";

/* nothing */
"Iran" = "Iran";

/* nothing */
"Iceland" = "Islanti";

/* nothing */
"Italy" = "Italia";

/* nothing */
"Jersey" = "Jersey";

/* nothing */
"Jamaica" = "Jamaika";

/* nothing */
"Jordan" = "Jordania";

/* nothing */
"Japan" = "Japani";

/* nothing */
"Kenya" = "Kenia";

/* nothing */
"Kyrgyzstan" = "Kirgisia";

/* nothing */
"Cambodia" = "Kambodža";

/* nothing */
"Kiribati" = "Kiribati";

/* nothing */
"Comoros" = "Komorit";

/* nothing */
"St. Kitts and Nevis" = "Saint Kitts ja Nevis";

/* nothing */
"North Korea" = "Pohjois-Korea";

/* nothing */
"South Korea" = "Etelä-Korea";

/* nothing */
"Kuwait" = "Kuwait";

/* nothing */
"Cayman Islands" = "Caymansaaret";

/* nothing */
"Kazakhstan" = "Kazakstan";

/* nothing */
"Laos" = "Laos";

/* nothing */
"Lebanon" = "Libanon";

/* nothing */
"Saint Lucia" = "Saint Lucia";

/* nothing */
"Liechtenstein" = "Liechtenstein";

/* nothing */
"Sri Lanka" = "Sri Lanka";

/* nothing */
"Liberia" = "Liberia";

/* nothing */
"Lesotho" = "Lesotho";

/* nothing */
"Lithuania" = "Liettua";

/* nothing */
"Luxembourg" = "Luxemburg";

/* nothing */
"Latvia" = "Latvia";

/* nothing */
"Libya" = "Libya";

/* nothing */
"Morocco" = "Marokko";

/* nothing */
"Monaco" = "Monaco";

/* nothing */
"Moldova" = "Moldova";

/* nothing */
"United States Medical" = "Lääketieteellinen (Yhdysvallat)";

/* nothing */
"Madagascar" = "Madagaskar";

/* nothing */
"Marshall Islands" = "Marshallsaaret";

/* nothing */
"Military" = "Sotilaallinen (Yhdysvallat)";

/* nothing */
"Macedonia" = "Makedonia";

/* nothing */
"Mali" = "Mali";

/* nothing */
"Myanmar" = "Myanmar";

/* nothing */
"Mongolia" = "Mongolia";

/* nothing */
"Macau" = "Macao";

/* nothing */
"Northern Mariana Islands" = "Pohjois-Mariaanit";

/* nothing */
"Martinique" = "Martinique";

/* nothing */
"Mauritania" = "Mauritania";

/* nothing */
"Montserrat" = "Montserrat";

/* nothing */
"Malta" = "Malta";

/* nothing */
"Mauritius" = "Mauritius";

/* nothing */
"Maldives" = "Malediivit";

/* nothing */
"Malawi" = "Malawi";

/* nothing */
"Mexico" = "Meksiko";

/* nothing */
"Malaysia" = "Malesia";

/* nothing */
"Mozambique" = "Mosambik";

/* nothing */
"Namibia" = "Namibia";

/* nothing */
"New Caledonia" = "Uusi-Kaledonia";

/* nothing */
"Niger" = "Niger";

/* nothing */
"Internic Network" = "Verkko";

/* nothing */
"Norfolk Island" = "Norfolkin saari";

/* nothing */
"Nigeria" = "Nigeria";

/* nothing */
"Nicaragua" = "Nicaragua";

/* nothing */
"Netherlands" = "Alankomaat";

/* nothing */
"Norway" = "Norja";

/* nothing */
"Nepal" = "Nepal";

/* nothing */
"Nauru" = "Nauru";

/* nothing */
"Niue" = "Niue";

/* nothing */
"New Zealand" = "Uusi-Seelanti";

/* nothing */
"Oman" = "Oman";

/* nothing */
"Internic Non-Profit Organization" = "Aatteellinen järjestö";

/* nothing */
"Panama" = "Panama";

/* nothing */
"Peru" = "Peru";

/* nothing */
"French Polynesia" = "Ranskan Polynesia";

/* nothing */
"Papua New Guinea" = "Papua-Uusi-Guinea";

/* nothing */
"Philippines" = "Filippiinit";

/* nothing */
"Pakistan" = "Pakistan";

/* nothing */
"Poland" = "Puola";

/* nothing */
"St. Pierre and Miquelon" = "Saint-Pierre ja Miquelon";

/* nothing */
"Pitcairn" = "Pitcairn";

/* nothing */
"Puerto Rico" = "Puerto Rico";

/* nothing */
"Palestinian Territory" = "Brittiläinen Intian valtameren alue";

/* nothing */
"Portugal" = "Portugali";

/* nothing */
"Palau" = "Palau";

/* nothing */
"Paraguay" = "Paraguay";

/* nothing */
"Qatar" = "Qatar";

/* nothing */
"Reunion" = "Réunion";

/* nothing */
"Romania" = "Romania";

/* nothing */
"Old School ARPAnet" = "Vanha ARPAnet";

/* nothing */
"Russian Federation" = "Venäjän Federaatio";

/* nothing */
"Rwanda" = "Ruanda";

/* nothing */
"Saudi Arabia" = "Saudi-Arabia";

/* nothing */
"Solomon Islands" = "Salomosaaret";

/* nothing */
"Seychelles" = "Seychellit";

/* nothing */
"Sudan" = "Sudan";

/* nothing */
"Sweden" = "Ruotsi";

/* nothing */
"Singapore" = "Singapore";

/* nothing */
"St. Helena" = "Saint Helena";

/* nothing */
"Slovenia" = "Slovenia";

/* nothing */
"Svalbard and Jan Mayen Islands" = "Svalbard- ja Jan Mayen -saaret";

/* nothing */
"Slovak Republic" = "Slovakia";

/* nothing */
"Sierra Leone" = "Sierra Leone";

/* nothing */
"San Marino" = "San Marino";

/* nothing */
"Senegal" = "Senegal";

/* nothing */
"Somalia" = "Somalia";

/* nothing */
"Suriname" = "Surinam";

/* nothing */
"Sao Tome and Principe" = "Sao Tome ja Principe";

/* nothing */
"Former USSR" = "Entinen Neuvostoliitto";

/* nothing */
"El Salvador" = "El Salvador";

/* nothing */
"Syria" = "Syyria";

/* nothing */
"Swaziland" = "Swasimaa";

/* nothing */
"Turks and Caicos Islands" = "Turks- ja Cairossaaret";

/* nothing */
"Chad" = "Tšad";

/* nothing */
"French Southern Territories" = "Ranskan eteläiset maa-alueet";

/* nothing */
"Togo" = "Togo";

/* nothing */
"Thailand" = "Thaimaa";

/* nothing */
"Tajikistan" = "Tadzikistan";

/* nothing */
"Tokelau" = "Tokelau";

/* nothing */
"East Timor" = "Itä-Timor";

/* nothing */
"Turkmenistan" = "Turkmenistan";

/* nothing */
"Tunisia" = "Tunisia";

/* nothing */
"Tonga" = "Tonga";

/* nothing */
"Turkey" = "Turkki";

/* nothing */
"Trinidad and Tobago" = "Trinidad ja Tobago";

/* nothing */
"Tuvalu" = "Tuvalu";

/* nothing */
"Taiwan" = "Taiwan";

/* nothing */
"Tanzania" = "Tansania";

/* nothing */
"Ukraine" = "Ukraina";

/* nothing */
"Uganda" = "Uganda";

/* nothing */
"United Kingdom" = "Iso-Britannia";

/* nothing */
"United States of America" = "Yhdysvallat";

/* nothing */
"Uruguay" = "Uruguay";

/* nothing */
"Uzbekistan" = "Uzbekistan";

/* nothing */
"Vatican City State" = "Vatikaanivaltio";

/* nothing */
"St. Vincent and the Grenadines" = "Saint Vincent ja Grenadiinit";

/* nothing */
"Venezuela" = "Venezuela";

/* nothing */
"British Virgin Islands" = "Brittiläiset Neitsytsaaret";

/* nothing */
"US Virgin Islands" = "Neitsytsaaret";

/* nothing */
"Vietnam" = "Vietnam";

/* nothing */
"Vanuatu" = "Vanuatu";

/* nothing */
"Wallis and Futuna Islands" = "Wallis ja Futuna";

/* nothing */
"Samoa" = "Samoa";

/* nothing */
"Yemen" = "Jemen";

/* nothing */
"Mayotte" = "Mayotte";

/* nothing */
"Yugoslavia" = "Jugoslavia";

/* nothing */
"South Africa" = "Etelä-Afrikka";

/* nothing */
"Zambia" = "Sambia";

/* nothing */
"Zimbabwe" = "Zimbabwe";

/* nothing */
"Unknown" = "Tuntematon";

/* nothing */
"Open Dialog Window" = "Avaa keskusteluikkuna";

/* nothing */
"Send a File" = "Lähetä tiedosto";

/* nothing */
"User Info (WHOIS)" = "Käyttäjätiedot (WHOIS)";

/* nothing */
"Operator Actions" = "Opin toiminnot";

/* nothing */
"Give Ops" = "Anna opit";

/* nothing */
"Take Ops" = "Poista opit";

/* nothing */
"Give Voice" = "Anna puheoikeus";

/* nothing */
"Take Voice" = "Poista puheoikeus";

/* nothing */
"Kick/Ban" = "Potkaise/Bannaa";

/* nothing */
"Kick" = "Potkaise";

/* nothing */
"Ban" = "Bannaa";

/* nothing */
"KickBan" = "Potkaise ja bannaa";

/* nothing */
"Direct client-to-client" = "Suora vertaisyhteys";

/* nothing */
"Send File" = "Lähetä tiedosto";

/* nothing */
"Offer Chat" = "Ehdota keskustelua";

/* nothing */
"Abort Chat" = "Keskeytä keskustelu";

/* nothing */
"Version" = "Versio";

/* nothing */
"Userinfo" = "Käyttäjätiedot";

/* nothing */
"Clientinfo" = "Asiakasohjelmatiedot";

/* nothing */
"Ping" = "Ping";

/* nothing */
"Time" = "Aika";

/* nothing */
"Finger" = "Tunnustelu";

/* nothing */
"Oper" = "Operaattori";

/* nothing */
"Kill this user" = "Tapa tämä käyttäjä";

/* nothing */
"Mode" = "Tila";

/* nothing */
"Give Half-Ops" = "Anna puoliopit";

/* nothing */
"Take Half-Ops" = "Poista puoliopit";

/* nothing */
"Ignore" = "Jätä huomiotta";

/* nothing */
"Ignore User" = "Jätä käyttäjä huomiotta";

/* nothing */
"UnIgnore User" = "Huomioi käyttäjä jälleen";

/* nothing */
"Info" = "Tiedot";

/* nothing */
"Who" = "Kuka";

/* nothing */
"WhoIs" = "KukaOn";

/* nothing */
"DNS Lookup" = "DNS-haku";

/* nothing */
"Trace" = "Jäljitä";

/* nothing */
"UserHost" = "KäyttäjäIsäntä";

/* nothing */
"External" = "Ulkoiset";

/* nothing */
"Traceroute" = "Traceroute";

/* nothing */
"Telnet" = "Telnet";

/* nothing */
"Leave Channel" = "Poistu kanavalta";

/* nothing */
"Join Channel..." = "Liity kanavalle...";

/* nothing */
"Enter Channel to Join:" = "Anna liityttävän kanavan nimi:";

/* nothing */
"Server Links" = "Palvelinlinkit";

/* nothing */
"Ping Server" = "Pingaa palvelinta";

/* nothing */
"Hide Version" = "Piilota versionumero";

/* nothing */
"Op" = "Oppaa";

/* nothing */
"DeOp" = "Opit pois";

/* nothing */
"bye" = "heihei";

/* nothing */
"Enter reason to kick %s:" = "Anna syy miksi %s potkaistaan:";

/* nothing */
"Sendfile" = "Lähetä";

/* nothing */
"Dialog" = "Keskustele";

/* nothing */
"Send" = "Lähetä";

/* nothing */
"Chat" = "Keskustelu";

/* nothing */
"Clear" = "Tyhjennä";

/* nothing */
"Couldn't connect to session bus" = "Istuntoväylään ei saatu yhteyttä";

/* nothing */
"Failed to complete NameHasOwner" = "NameHasOwner-komennon suoritus epäonnistui";

/* nothing */
"Failed to complete Command" = "Komennon suoritus epäonnistui";

/* nothing */
"remote access" = "etäkäyttö";

/* nothing */
"plugin for remote access using DBUS" = "Liitännäinen, joka mahdollistaa etäkäytön DBUS-yhteyden yli.";

/* nothing */
"Couldn't connect to session bus: %s\n" = "Istuntoväylään ei saatu yhteyttä: %s\n";

/* nothing */
"Failed to acquire %s: %s\n" = "Virhe palvelussa %s: %s\n";

/* nothing */
"About XChat" = "Tietoja XChatista";

/* nothing */
"A multiplatform IRC Client" = "Usealla alustalla toimiva IRC-asiakasohjelma";

/* nothing */
"Character Chart" = "Merkistökartta";

/* nothing */
"Not connected." = "Palvelimeen ei ole yhteyttä.";

/* nothing */
"You must select some bans." = "Valitse vähintään yksi banni.";

/* nothing */
"Are you sure you want to remove all bans in %s?" = "Poistetaanko kaikki kanavan %s bannit?";

/* nothing */
"Mask" = "Peite";

/* nothing */
"From" = "Keneltä";

/* nothing */
"Date" = "Päiväys";

/* nothing */
"You can only open the Ban List window while in a channel tab." = "Banniluettelon voi avata vain, kun jokin kanavaikkuna on valittuna.";

/* nothing */
"XChat: Ban List (%s)" = "XChat: Banniluettelo (%s)";

/* nothing */
"Unban" = "Poista banni";

/* nothing */
"Crop" = "Poista muut";

/* nothing */
"Refresh" = "Päivitä";

/* nothing */
"Displaying %d/%d users on %d/%d channels." = "Näkyvillä on %d/%d käyttäjää %d/%d kanavalla.";

/* nothing */
"Select an output filename" = "Valitse tulostiedoston nimi";

/* nothing */
"_Join Channel" = "Liity kanavalle";

/* nothing */
"_Copy Channel Name" = "Kopioi kanavanimi";

/* nothing */
"Copy _Topic Text" = "Kopioi kanavan aihepiiriteksti";

/* nothing */
"XChat: Channel List (%s)" = "XChat: Kanavaluettelo (%s)";

/* nothing */
"_Search" = "Hae";

/* nothing */
"_Download List" = "Lataa luettelo";

/* nothing */
"Save _List..." = "Tallenna luettelo...";

/* nothing */
"Show only:" = "Näytä vain:";

/* nothing */
"channels with" = "kanavat, joilla on";

/* nothing */
"to" = "—";

/* nothing */
"users." = "käyttäjää.";

/* nothing */
"Look in:" = "Käy läpi:";

/* nothing */
"Channel name" = "Kanavanimi";

/* nothing */
"Search type:" = "Hakutapa:";

/* nothing */
"Simple Search" = "Yksinkertainen haku";

/* nothing */
"Pattern Match (Wildcards)" = "Hakulauseke (jokerimerkit)";

/* nothing */
"Regular Expression" = "Säännöllinen lauseke";

/* nothing */
"Find:" = "Etsi:";

/* nothing */
"Send file to %s" = "Lähetä tiedosto käyttäjälle %s";

/* nothing */
"That file is not resumable." = "Tämän tiedoston siirtoa ei voi jatkaa.";

/* nothing */
"Cannot access file: %s\n%s.\nResuming not possible." = "Tiedostoa ei voi käsitellä: %s\n%s.\nJatkaminen ei ole mahdollista.";

/* nothing */
"File in download directory is larger than file offered. Resuming not possible." = "Tiedosto latauskansiossa on suurempi kuin tarjottu tiedosto. Jatkaminen ei ole mahdollista.";

/* nothing */
"Cannot resume the same file from two people." = "Saman tiedoston siirtoa ei voi jatkaa kahdelta käyttäjältä.";

/* nothing */
"XChat: Uploads and Downloads" = "XChat: Tiedostonsiirrot";

/* nothing */
"Status" = "Tila";

/* nothing */
"File" = "Tiedosto";

/* nothing */
"ETA" = "Arvioitu aika";

/* nothing */
"Both" = "Molemmat";

/* nothing */
"Uploads" = "Lähetykset";

/* nothing */
"Downloads" = "Lataukset";

/* nothing */
"Details" = "Lisätiedot";

/* nothing */
"File:" = "Tiedosto:";

/* nothing */
"Address:" = "Osoite:";

/* nothing */
"Abort" = "Keskeytä";

/* nothing */
"Accept" = "Hyväksy";

/* nothing */
"Resume" = "Jatka";

/* nothing */
"Open Folder..." = "Avaa kansio...";

/* nothing */
"XChat: DCC Chat List" = "XChat: DCC-keskusteluluettelo";

/* nothing */
"Recv" = "Saapunut";

/* nothing */
"Sent" = "Lähetetty";

/* nothing */
"Start Time" = "Aloitusaika";

/* nothing */
"*NEW*" = "*UUSI*";

/* nothing */
"EDIT ME" = "MUOKKAA TÄTÄ";

/* nothing */
"Name" = "Nimi";

/* nothing */
"Command" = "Komento";

/* nothing */
"Move Up" = "Siirrä ylemmäs";

/* nothing */
"Move Dn" = "Siirrä alemmas";

/* nothing */
"Cancel" = "Peru";

/* nothing */
"Save" = "Tallenna";

/* nothing */
"Add New" = "Lisää uusi";

/* nothing */
"Delete" = "Poista";

/* nothing */
"Sort" = "Lajittele";

/* nothing */
"Help" = "Ohje";

/* nothing */
"Don't auto connect to servers" = "ei ota yhteyttä palvelimiin";

/* nothing */
"Use a different config directory" = "käyttää erityistä asetushakemistoa";

/* nothing */
"Don't auto load any plugins" = "ei lataa liitännäisiä";

/* nothing */
"Show plugin auto-load directory" = "näyttää vakioliitännäisten hakemiston";

/* nothing */
"Show user config directory" = "näyttää käyttäjän asetushakemiston";

/* nothing */
"Open an irc://server:port/channel URL" = "avaa URLin (irc://palvelin:portti/kanava)";

/* nothing */
"Open URL in an existing XChat" = "Avaa URL käynnissä olevaan XChattiin";

/* nothing */
"Begin minimized. Level 0=Normal 1=Iconified 2=Tray" = "Aloita pienennettynä. Taso: 0=tavallinen, 1=kuvakkeena, 2=ilmoitusalueella";

/* nothing */
"level" = "taso";

/* nothing */
"Show version information" = "näyttää versiotiedot";

/* nothing */
"Failed to open font:\n\n%s" = "Kirjasimen avaaminen ei onnistunut:\n\n%s";

/* nothing */
"Search buffer is empty.\n" = "Hakupuskuri on tyhjä.\n";

/* nothing */
"%d bytes" = "%d tavua";

/* nothing */
"Network send queue: %d bytes" = "Verkon lähetysjonossa on %d tavua.";

/* nothing */
"The Run Command action runs the data in Data 1 as if it has been typed into the entry box where you pressed the key sequence. Thus it can contain text (which will be sent to the channel/person), commands or user commands. When run all \\n characters in Data 1 are used to deliminate seperate commands so it is possible to run more than one command. If you want a \\ in the actual text run then enter \\\\" = "Run Command -komento ajaa Data 1:n sisällön, kuin se olisi kirjoitettu syötekenttään, jossa näppäinyhdistelmää painettiin. Se voi siis sisältää tekstiä (joka lähetetään kanavalle/henkilölle), komentoja tai käyttäjäkomentoja. Ajettaessa kaikki Data 1:n sisältämät \\n-merkit tulkitaan komentojen erottimiksi; siten on mahdollista ajaa useampi komento. Jos haluat \\-merkin varsinaiseen tekstiin, käytä merkintää \\\\";

/* nothing */
"The Change Page command switches between pages in the notebook. Set Data 1 to the page you want to switch to. If Data 2 is set to anything then the switch will be relative to the current position" = "Change Page -komento siirtyy välilehdeltä toiselle. Aseta Data 1:n arvoksi lehti, jolle halutaan siirtyä. Jos Data 2 on asetettu, siirtyminen on suhteessa nykyiseen sijaintiin";

/* nothing */
"The Insert in Buffer command will insert the contents of Data 1 into the entry where the key sequence was pressed at the current cursor position" = "Insert in Buffer -komento lisää Data 1:n sisällön syöteriville kohdistimen kohdalle";

/* nothing */
"The Scroll Page command scrolls the text widget up or down one page or one line. Set Data 1 to either Up, Down, +1 or -1." = "Scroll Page -komento vierittää tekstikenttää (Data 1:n arvosta riippuen) ylös tai alas yhden sivun (Up, Down) tai rivin (+1, -1) verran.";

/* nothing */
"The Set Buffer command sets the entry where the key sequence was entered to the contents of Data 1" = "Set Buffer -komento asettaa syöteriviksi Data 1:n sisällön";

/* nothing */
"The Last Command command sets the entry to contain the last command entered - the same as pressing up in a shell" = "Last Command -komento asettaa syöteriviksi edellisen annetun komennon - vastaa ylänuolen painamista kuoressa";

/* nothing */
"The Next Command command sets the entry to contain the next command entered - the same as pressing down in a shell" = "Next Command -komento asettaa syöteriviksi seuraavan annetun komennon - vastaa alanuolen painamista kuoressa";

/* nothing */
"This command changes the text in the entry to finish an incomplete nickname or command. If Data 1 is set then double-tabbing in a string will select the last nick, not the next" = "Tämä komento täydentää syöterivillä osoittimen edellä olevan epätäydellisen kutsumanimen tai komennon. Jos Data 1 on asetettu, kaksi kertaa painaminen valitsee edellisen kutsumanimen, ei seuraavaa";

/* nothing */
"This command scrolls up and down through the list of nicks. If Data 1 is set to anything it will scroll up, else it scrolls down" = "Tämä komento vierittää käyttäjäluetteloa ylös ja alas. Jos Data 1 on asetettu, luetteloa vieritetään ylös, muutoin alas";

/* nothing */
"This command checks the last word entered in the entry against the replace list and replaces it if it finds a match" = "Tämä komento vertaa viimeistä annettua sanaa korvauslistaan ja muuttaa sen,jos löytyy täsmäävyys.";

/* nothing */
"This command moves the front tab left by one" = "Tämä komento siirtää päällimmäistä välilehteä yhden vasemmalle";

/* nothing */
"This command moves the front tab right by one" = "Tämä komento siirtää päällimmäistä välilehteä yhden oikealle";

/* nothing */
"This command moves the current tab family to the left" = "Tämä komento siirtää nykyistä välilehtiötä vasemmalle";

/* nothing */
"This command moves the current tab family to the right" = "Tämä komento siirtää nykyistä välilehtiötä oikealle";

/* nothing */
"Push input line into history but doesn't send to server" = "Lisää syöterivin historiaan, mutta ei lähetä palvelimelle";

/* nothing */
"There was an error loading key bindings configuration" = "Virhe ladattaessa näppäinsidonta-asetuksia";

/* nothing */
"<none>" = "<ei mitään>";

/* nothing */
"Mod" = "Määre";

/* nothing */
"Key" = "Näppäin";

/* nothing */
"Action" = "Toiminto";

/* nothing */
"XChat: Keyboard Shortcuts" = "XChat: Pikanäppäimet";

/* nothing */
"Shift" = "Vaihto";

/* nothing */
"Alt" = "Alt";

/* nothing */
"Ctrl" = "Ctrl";

/* nothing */
"Data 1" = "Data 1";

/* nothing */
"Data 2" = "Data 2";

/* nothing */
"Error opening keys config file\n" = "Virhe avattaessa näppäinasetustiedostoa\n";

/* nothing */
"Unknown keyname %s in key bindings config file\nLoad aborted, please fix %s/keybindings.conf\n" = "Tuntematon näppäinnimi %s näppäinsidontojen asetustiedostossa\nLataus keskeytetty, korjaa tiedosto %s/keybindings\n";

/* nothing */
"Unknown action %s in key bindings config file\nLoad aborted, Please fix %s/keybindings\n" = "Tuntematon toiminto %s näppäinsidontojen asetustiedostossa\nLataus keskeytetty, korjaa tiedosto %s/keybindings\n";

/* nothing */
"Expecting Data line (beginning Dx{:|!}) but got:\n%s\n\nLoad aborted, Please fix %s/keybindings\n" = "Odotettiin Datariviä (alku Dx{:|!}), mutta saatiin:\n%s\n\nLataus keskeytetty, korjaa tiedosto %s/keybindings\n";

/* nothing */
"Key bindings config file is corrupt, load aborted\nPlease fix %s/keybindings.conf\n" = "Näppäinsidontojen asetustiedosto on turmeltunut, lataus keskeytetty\nKorjaa tiedosto %s/keybindings.conf\n";

/* nothing */
"Cannot write to that file." = "Antamaasi tiedostoon ei voi kirjoittaa.";

/* nothing */
"Cannot read that file." = "Antamaasi tiedostoa ei voi lukea.";

/* nothing */
"That mask already exists." = "Kyseinen peite on jo olemassa.";

/* nothing */
"Private" = "Yksityiset";

/* nothing */
"Notice" = "Tiedotteet";

/* nothing */
"CTCP" = "CTCP";

/* nothing */
"DCC" = "DCC";

/* nothing */
"Invite" = "Kutsut";

/* nothing */
"Unignore" = "Huomioi toistaiseksi";

/* nothing */
"Enter mask to ignore:" = "Anna peite huomiotta jätettäville:";

/* nothing */
"XChat: Ignore list" = "XChat: Huomioimattomuusluettelo";

/* nothing */
"Ignore Stats:" = "Huomioimattomuustilastot:";

/* nothing */
"Channel:" = "Kavavia:";

/* nothing */
"Private:" = "Yksityisiä:";

/* nothing */
"Notice:" = "Ilmoituksia:";

/* nothing */
"CTCP:" = "CTCP:";

/* nothing */
"Invite:" = "Kutsuja:";

/* nothing */
"Add..." = "Lisää uusi...";

/* nothing */
"Channel name too short, try again." = "Kanavan nimi on liian lyhyt. Yritä uudestaan.";

/* nothing */
"XChat: Connection Complete" = "XChat: Yhteys muodostettu";

/* nothing */
"Connection to %s complete." = "Yhteys palvelimeen %s on valmis.";

/* nothing */
"In the Server-List window, no channel (chat room) has been entered to be automatically joined for this network." = "Palvelinluetteloon ei ole tälle IRC-verkolle syötetty yhtään kanavaa, joille tulisi liittyä automaattisesti.";

/* nothing */
"What would you like to do next?" = "Mitä haluat tehdä?";

/* nothing */
"_Nothing, I'll join a channel later." = "_En mitään, liityn kanaville itse.";

/* nothing */
"_Join this channel:" = "_Liittyä kanavalle:";

/* nothing */
"If you know the name of the channel you want to join, enter it here." = "Jos tiedät mille kanavalle haluat liittyä, kirjoita sen nimi tähän.";

/* nothing */
"O_pen the Channel-List window." = "Avata kanava_luettelon:";

/* nothing */
"Retrieving the Channel-List may take a minute or two." = "Kanavaluettelon kerääminen saattaa kestää parikin minuuttia.";

/* nothing */
"_Always show this dialog after connecting." = "Näytä tämä valintaikkuna _aina, kun yhteys on muodostettu.";

/* nothing */
"Dialog with" = "Keskustelijana";

/* nothing */
"Topic for %s is: %s" = "Kanavan %s aihe on: %s";

/* nothing */
"No topic is set" = "Kanavalla ei ole aihetta.";

/* nothing */
"This server still has %d channels or dialogs associated with it. Close them all?" = "Palvelimelta on edelleen auki %d kanavaa tai keskustelua. Suljetaanko kaikki?";

/* nothing */
"Quit XChat?" = "Lopetetaanko XChat?";

/* nothing */
"Don't ask next time." = "Älä kysy jatkossa.";

/* nothing */
"You are connected to %i IRC networks." = "Ollaan yhteydessä %i IRC-verkkoon.";

/* nothing */
"Are you sure you want to quit?" = "Lopetetaanko varmasti?";

/* nothing */
"Some file transfers are still active." = "Tiedostonsiirtoja on vielä käynnissä.";

/* nothing */
"_Minimize to Tray" = "Pienennä ilmoitusalueelle";

/* nothing */
"Insert Attribute or Color Code" = "Lisää määre tai värikoodi";

/* nothing */
"<b>Bold</b>" = "<b>Lihavoitu</b>";

/* nothing */
"<u>Underline</u>" = "<u>Alleviivattu</u>";

/* nothing */
"Normal" = "Tavallinen";

/* nothing */
"Colors 0-7" = "Värit 0–7";

/* nothing */
"Colors 8-15" = "Värit 8–15";

/* nothing */
"Beep on message" = "Anna äänimerkki viestin saapuessa";

/* nothing */
"Blink tray on message" = "Välkytä ilmoitusalueella viestin saapuessa";

/* nothing */
"Show join/part messages" = "Näytä liittymis/poistumisviestit";

/* nothing */
"Color paste" = "Liitä väritysten kanssa";

/* nothing */
"_Close Tab" = "_Sulje välilehti";

/* nothing */
"_Detach Tab" = "_Irrota välilehti";

/* nothing */
"User limit must be a number!\n" = "Käyttäjärajan tulee olla numero!\n";

/* nothing */
"Topic Protection" = "Aiheensuojaus";

/* nothing */
"No outside messages" = "Ei ulkopuolisia viestejä";

/* nothing */
"Secret" = "Salainen";

/* nothing */
"Invite Only" = "Vain kutsutuille";

/* nothing */
"Moderated" = "Moderoitu";

/* nothing */
"Ban List" = "Banniluettelo";

/* nothing */
"Keyword" = "Tunnussana";

/* nothing */
"User Limit" = "Käyttäjäraja";

/* nothing */
"Show/Hide userlist" = "Näytä/piilota käyttäjäluettelo";

/* nothing */
"Unable to set transparent background!\n\nYou may be using a non-compliant window\nmanager that is not currently supported.\n" = "Taustaa ei voi asettaa läpikuultavaksi!\n\nIkkunointiohjelma on ehkä epäyhteensopiva,\neikä sitä tällä hetkellä tueta.\n";

/* nothing */
"Enter new nickname:" = "Anna uusi kutsumanimi:";

/* nothing */
"Host unknown" = "Tuntematon isäntä";

/* nothing */
"<tt><b>%-11s</b></tt> %s" = "<tt><b>%-11s</b></tt> %s";

/* nothing */
"Real Name:" = "Oikea nimi:";

/* nothing */
"User:" = "Käyttäjä:";

/* nothing */
"Country:" = "Maa:";

/* nothing */
"Server:" = "Palvelin:";

/* nothing */
"Away Msg:" = "Poissaoloviesti:";

/* nothing */
"%u minutes ago" = "%u minuuttia sitten";

/* nothing */
"Last Msg:" = "Puhunut kanavalla:";

/* nothing */
"The Menubar is now hidden. You can show it again by pressing F9 or right-clicking in a blank part of the main text area." = "Valikkopalkki on nyt piilossa. Sen saa taas esiin painamalla Ctrl-F9:ää tai hiiren oikeaa painiketta tekstialueen tyhjässä kohdassa.";

/* nothing */
"Open Link in Browser" = "Avaa linkki selaimeen";

/* nothing */
"Copy Selected Link" = "Kopioi valittu linkki";

/* nothing */
"Join Channel" = "Liity kanavalle";

/* nothing */
"Part Channel" = "Poistu kanavalta";

/* nothing */
"Cycle Channel" = "Liity kanavalle uudelleen";

/* nothing */
"XChat: User menu" = "XChat: Käyttäjän valikko";

/* nothing */
"Edit This Menu..." = "Muokkaa tätä valikkoa...";

/* nothing */
"Retrieve channel list..." = "Valitse kanavaluettelosta...";

/* nothing */
"User Commands - Special codes:\n\n%c  =  current channel\n%e  =  current network name\n%m  =  machine info\n%n  =  your nick\n%t  =  time/date\n%v  =  xchat version\n%2  =  word 2\n%3  =  word 3\n&2  =  word 2 to the end of line\n&3  =  word 3 to the end of line\n\neg:\n/cmd john hello\n\n%2 would be \"john\"\n&2 would be \"john hello\"." = "Käyttäjän komennot - Erikoiskoodit:\n\n%c  =  nykyinen kanava\n%e  =  nykyinen verkko\n%m  =  koneen tiedot\n%n  =  oma kutsumanimi\n%t  =  aika/päiväys\n%v  =  xchat-versio\n%2  =  2. sana\n%3  =  3. sana\n&2  =  2. sanasta rivin loppuun\n&3  =  3. sanasta rivin loppuun\n\nesim:\n/cmd jarkko terve\n\n%2 olisi \"jarkko\"\n&2 olisi \"jarkko terve\".";

/* nothing */
"Userlist Buttons - Special codes:\n\n%a  =  all selected nicks\n%c  =  current channel\n%e  =  current network name\n%h  =  selected nick's hostname\n%m  =  machine info\n%n  =  your nick\n%s  =  selected nick\n%t  =  time/date\n" = "Käyttäjälistapainikkeet - Erikoiskoodit:\n\n%a  =  kaikki valitut kutsumanimet\n%e  =  nykyinen verkko\n%c  =  nykyinen kanava\n%h  =  valitun käyttäjän isäntänimi\n%m  =  koneen tiedot\n%n  =  oma kutsumanimi\n%s  =  valittu kutsumanimi\n%t  =  aika/päiväys\n";

/* nothing */
"Dialog Buttons - Special codes:\n\n%a  =  all selected nicks\n%c  =  current channel\n%e  =  current network name\n%h  =  selected nick's hostname\n%m  =  machine info\n%n  =  your nick\n%s  =  selected nick\n%t  =  time/date\n" = "Keskustelupainikkeet - Erikoiskoodit:\n\n%a  =  kaikki valitut kutsumanimet\n%c  =  nykyinen kanava\n%e  =  nykyinen verkko\n%h  =  valitun käyttäjän isäntänimi\n%m  =  koneen tiedot\n%n  =  oma kutsumanimi\n%s  =  valittu kutsumanimi\n%t  =  aika/päiväys\n";

/* nothing */
"CTCP Replies - Special codes:\n\n%d  =  data (the whole ctcp)\n%e  =  current network name\n%m  =  machine info\n%s  =  nick who sent the ctcp\n%t  =  time/date\n%2  =  word 2\n%3  =  word 3\n&2  =  word 2 to the end of line\n&3  =  word 3 to the end of line\n\n" = "CTCP-vastaukset - Erikoiskoodit:\n\n%d  =  data (koko ctcp)\n%e  =  nykyinen verkko\n%m  =  koneen tiedot\n%s  =  ctcp:n lähettäjän kutsumanimi\n%t  =  aika/päiväys\n%2  =  2. sana\n%3  =  3. sana\n&2  =  2. sanasta rivin loppuun\n&3  =  3. sanasta rivin loppuun\n\n";

/* nothing */
"URL Handlers - Special codes:\n\n%s  =  the URL string\n\nPutting a ! infront of the command\nindicates it should be sent to a\nshell instead of XChat" = "URL-käsittelimet - Erikoiskoodit:\n\n%s  =  URL-merkkijono\n\nHuutomerkki (!) komennon edessä ilmaisee,\nettä komento lähetetään XChatin sijaan\nkuorelle.";

/* nothing */
"XChat: User Defined Commands" = "XChat: Käyttäjän määrittelemät komennot";

/* nothing */
"XChat: Userlist Popup menu" = "XChat: Käyttäjäluettelon ponnahdusvalikko";

/* nothing */
"Replace with" = "Korvaava teksti";

/* nothing */
"XChat: Replace" = "XChat: Korvaaminen";

/* nothing */
"XChat: URL Handlers" = "XChat: URL-käsittelimet";

/* nothing */
"XChat: Userlist buttons" = "XChat: Käyttäjäluettelon painikkeet";

/* nothing */
"XChat: Dialog buttons" = "XChat: Keskusteluikkunan painikkeet";

/* nothing */
"XChat: CTCP Replies" = "XChat: CTCP-vastaukset";

/* nothing */
"_XChat" = "_XChat";

/* nothing */
"Network Li_st..." = "Verkkoluettelo...";

/* nothing */
"_New" = "Uusi";

/* nothing */
"Server Tab..." = "Palvelinvälilehti...";

/* nothing */
"Channel Tab..." = "Kanavavälilehti...";

/* nothing */
"Server Window..." = "Palvelinikkuna...";

/* nothing */
"Channel Window..." = "Kanavaikkuna...";

/* nothing */
"_Load Plugin or Script..." = "Lataa skripti tai liitännäinen...";

/* nothing */
"_Quit" = "Lopeta";

/* nothing */
"_View" = "Näytä";

/* nothing */
"_Menu Bar" = "Valikkopalkki";

/* nothing */
"_Topic Bar" = "Aihepalkki";

/* nothing */
"_User List" = "Käyttäjäluettelo";

/* nothing */
"U_serlist Buttons" = "Käyttäjäluettelon painikkeet";

/* nothing */
"M_ode Buttons" = "Tilapainikkeet";

/* nothing */
"_Channel Switcher" = "Kanavavalitsin";

/* nothing */
"_Tabs" = "Välilehtinä";

/* nothing */
"T_ree" = "Puuna";

/* nothing */
"_Network Meters" = "Verkkomittarit";

/* nothing */
"Off" = "Poissa";

/* nothing */
"Graph" = "Graafinen";

/* nothing */
"_Server" = "_Palvelin";

/* nothing */
"_Disconnect" = "Katkaise yhteys";

/* nothing */
"_Reconnect" = "Yhdistä uudelleen";

/* nothing */
"Marked Away" = "Merkitty poissaolevaksi";

/* nothing */
"_Usermenu" = "Käyttäjävalikko";

/* nothing */
"S_ettings" = "A_setukset";

/* nothing */
"_Preferences" = "Ominaisuudet";

/* nothing */
"Advanced" = "Lisäasetukset";

/* nothing */
"Auto Replace..." = "Automaattikorvaukset...";

/* nothing */
"CTCP Replies..." = "CTCP-vastaukset...";

/* nothing */
"Dialog Buttons..." = "Keskusteluikkunan painikkeet...";

/* nothing */
"Keyboard Shortcuts..." = "Pikanäppäimet...";

/* nothing */
"Text Events..." = "Tapahtumatekstit...";

/* nothing */
"URL Handlers..." = "URL-käsittelimet...";

/* nothing */
"User Commands..." = "Käyttäjän komennot...";

/* nothing */
"Userlist Buttons..." = "Käyttäjäluettelon painikkeet...";

/* nothing */
"Userlist Popup..." = "Käyttäjäluettelon pikavalikko...";

/* nothing */
"_Window" = "_Ikkuna";

/* nothing */
"Ban List..." = "Banniluettelo...";

/* nothing */
"Channel List..." = "Kanavaluettelo...";

/* nothing */
"Character Chart..." = "Merkistökartta...";

/* nothing */
"Direct Chat..." = "DCC-keskustelu...";

/* nothing */
"File Transfers..." = "Tiedostonsiirrot...";

/* nothing */
"Ignore List..." = "Huomioimattomuusluettelo...";

/* nothing */
"Notify List..." = "Ilmoitusluettelo...";

/* nothing */
"Plugins and Scripts..." = "Skriptit ja liitännäiset...";

/* nothing */
"Raw Log..." = "Raakaloki...";

/* nothing */
"URL Grabber..." = "URL-kaappaaja...";

/* nothing */
"Reset Marker Line" = "Siirrä lukumerkki loppuun";

/* nothing */
"C_lear Text" = "P_yyhi teksti";

/* nothing */
"Search Text..." = "Hae tekstistä...";

/* nothing */
"Save Text..." = "Tallenna teksti...";

/* nothing */
"_Help" = "_Ohje";

/* nothing */
"_Contents" = "_Sisältö";

/* nothing */
"_About" = "_Tietoja";

/* nothing */
"_Attach Window" = "Kiinnitä ikkuna";

/* nothing */
"_Close Window" = "Sulje ikkuna";

/* nothing */
"User" = "Käyttäjä";

/* nothing */
"Last Seen" = "Nähty viimeksi";

/* nothing */
"Offline" = "Tavoittamattomissa";

/* nothing */
"Never" = "Ei koskaan";

/* nothing */
"%d minutes ago" = "%d minuuttia sitten";

/* nothing */
"Online" = "Tavoitettavissa";

/* nothing */
"Enter nickname to add:" = "Anna lisättävä kutsumanimi:";

/* nothing */
"Notify on these networks:" = "Ilmoita seuraavissa verkoissa:";

/* nothing */
"Comma separated list of networks is accepted." = "Pilkuilla eroteltu luettelo IRC-verkkoja.";

/* nothing */
"XChat: Notify List" = "XChat: Ilmoitusluettelo";

/* nothing */
"Remove" = "Poista";

/* nothing */
"Open Dialog" = "Aloita keskustelu";

/* nothing */
"Cannot find 'notify-send' to open balloon alerts.\nPlease install libnotify." = "Komentoa 'notify-send' ei löydy, joten puhekuplia ei voida näyttää.\nTilanteen korjaamiseksi pitää asentaa libnotify.";

/* nothing */
"XChat: Connected to %u networks and %u channels" = "XChat: Yhteydessä %u verkkoon ja %u kanavaan";

/* nothing */
"_Restore" = "Palauta";

/* nothing */
"_Hide" = "Piilota";

/* nothing */
"_Blink on" = "Välkytä kun tulee";

/* nothing */
"Channel Message" = "Kanavaviesti";

/* nothing */
"Private Message" = "Yksityisviesti";

/* nothing */
"Highlighted Message" = "Korostettu viesti";

/* nothing */
"XChat: Highlighted message from: %s (%s)" = "XChat: Korostettu viesti käyttäjältä %s (%s)";

/* nothing */
"XChat: %u highlighted messages, latest from: %s (%s)" = "XChat: %u korostettua viestiä, viimeksi käyttäjältä %s (%s)";

/* nothing */
"XChat: New public message from: %s (%s)" = "XChat: Uusi julkinen viesti käyttäjältä: %s (%s)";

/* nothing */
"XChat: %u new public messages." = "XChat: %u uutta julkista viestiä.";

/* nothing */
"XChat: Private message from: %s (%s)" = "XChat: Yksityisviesti käyttäjältä %s (%s)";

/* nothing */
"XChat: %u private messages, latest from: %s (%s)" = "XChat: %u yksityisviestiä, viimeksi käyttäjältä %s (%s)";

/* nothing */
"XChat: File offer from: %s (%s)" = "XChat: Käyttäjä %s tarjoaa tiedostoa (%s)";

/* nothing */
"XChat: %u file offers, latest from: %s (%s)" = "XChat: %u tiedostoa tarjottu, vimeksi käyttäjältä %s (%s)";

/* nothing */
"Description" = "Kuvaus";

/* nothing */
"Select a Plugin or Script to load" = "Valitse ladattava skripti tai liitännäinen";

/* nothing */
"XChat: Plugins and Scripts" = "XChat: Skriptit ja liitännäiset";

/* nothing */
"_Load..." = "_Lataa...";

/* nothing */
"_UnLoad" = "_Poista käytöstä";

/* nothing */
"_Close" = "_Sulje";

/* nothing */
"Save As..." = "Tallenna...";

/* nothing */
"XChat: Rawlog (%s)" = "XChat: Raakaloki (%s)";

/* nothing */
"Clear rawlog" = "Tyhjennä raakaloki";

/* nothing */
"The window you opened this Search for doesn't exist anymore." = "Tätä hakua varten avaamaasi ikkunaa ei enää ole.";

/* nothing */
"Search hit end, not found." = "Hakutekstiä ei löytynyt";

/* nothing */
"XChat: Search" = "XChat: Haku";

/* nothing */
"_Match case" = "Huomioi kirjainten koko";

/* nothing */
"Search _backwards" = "Etsi taaksepäin";

/* nothing */
"_Find" = "Etsi";

/* nothing */
"New Network" = "Uusi verkko";

/* nothing */
"Really remove network \"%s\" and all its servers?" = "Haluatko todella poistaa verkon \"%s\" ja kaikki sen palvelimet?";

/* nothing */
"User name and Real name cannot be left blank." = "Käyttäjätunnusta ja oikeaa nimeä ei voi jättää tyhjiksi.";

/* nothing */
"XChat: Edit %s" = "XChat: Muokkaa %s-verkkoa";

/* nothing */
"Servers for %s" = "%s-verkon palvelimet";

/* nothing */
"Connect to selected server only" = "Yhdistä vain valittuun palvelimeen";

/* nothing */
"Don't cycle through all the servers when the connection fails." = "Älä yritä yhdistää muihin palvelimiin, jos valittuun palvelimeen ei saada yhteyttä.";

/* nothing */
"Your Details" = "Käyttäjätiedot";

/* nothing */
"Use global user information" = "Käytä yleisiä käyttäjätietoja";

/* nothing */
"_Nick name:" = "Kutsumanimi:";

/* nothing */
"Second choice:" = "2. vaihtoehto:";

/* nothing */
"_User name:" = "Käyttäjätunnus:";

/* nothing */
"Rea_l name:" = "Oikea nimi:";

/* nothing */
"Connecting" = "Yhteyden muodostus";

/* nothing */
"Auto connect to this network at startup" = "Yhdistä valmiiksi, kun X-Chat käynnistyy";

/* nothing */
"Use a proxy server" = "Käytä välipalvelinta";

/* nothing */
"Use SSL for all the servers on this network" = "Käytä SSL-yhteyttä tässä verkossa";

/* nothing */
"Accept invalid SSL certificate" = "Hyväksy epäkelpo varmenne";

/* nothing */
"C_hannels to join:" = "Avattavat kanavat:";

/* nothing */
"Channels to join, separated by commas, but not spaces!" = "Näille kanaville liitytään automaattisesti. Erota kanavat toisistaan pilkuin (mutta ei välilyönnein!).";

/* nothing */
"Connect command:" = "Yhdistämiskomento:";

/* nothing */
"Extra command to execute after connecting. If you need more than one, set this to LOAD -e <filename>, where <filename> is a text-file full of commands to execute." = "Lisäkomento, joka suoritetaan yhteyden muodostuttua. Useita komentoja voi suorittaa laittamalla ne tiedostoon, ja kirjoittamalla tähän \"LOAD -e <tiedostonimi>\".";

/* nothing */
"Nickserv password:" = "Kutsumanimen salasana:";

/* nothing */
"If your nickname requires a password, enter it here. Not all IRC networks support this." = "Jos kutsumanimesi on suojattu NickServ-palvelun salasanalla, kirjoita se tähän. Huomaa että kaikki IRC-verkot eivät tue salasanasuojausta.";

/* nothing */
"Server password:" = "Palvelimen salasana:";

/* nothing */
"Password for the server, if in doubt, leave blank." = "Palvelimelle tarvittava salasana. Jätä tyhjäksi, jos olet epävarma.";

/* nothing */
"Character set:" = "Merkistö:";

/* nothing */
"_Edit" = "_Muokkaa";

/* nothing */
"XChat: Network List" = "XChat: Verkkoluettelo";

/* nothing */
"User Information" = "Käyttäjätiedot";

/* nothing */
"Third choice:" = "3. vaihtoehto:";

/* nothing */
"Networks" = "IRC-verkot";

/* nothing */
"Skip network list on startup" = "Aloita ilman verkkoluetteloa";

/* nothing */
"_Edit..." = "_Muokkaa...";

/* nothing */
"_Sort" = "Lajittele";

/* nothing */
"Sorts the network list in alphabetical order. Use SHIFT-UP and SHIFT-DOWN keys to move a row." = "Lajittelee verkkoluettelon aakkosjärjestykseen. Riviä voi siirtää näppäilemällä SHIFT-YLÖS ja SHIFT-ALAS.";

/* nothing */
"C_onnect" = "_Yhdistä";

/* nothing */
"Text Box Appearance" = "Tekstilaatikon ulkonäkö";

/* nothing */
"Font:" = "Kirjasin:";

/* nothing */
"Background image:" = "Taustakuva:";

/* nothing */
"Scrollback lines:" = "Vieritettäviä rivejä:";

/* nothing */
"Colored nick names" = "Väritä kutsumanimet";

/* nothing */
"Give each person on IRC a different color" = "Anna kullekin käyttäjälle oma väri.";

/* nothing */
"Indent nick names" = "Sisennä kutsumanimet";

/* nothing */
"Make nick names right-justified" = "Tasaa kutsumanimet oikealle.";

/* nothing */
"Transparent background" = "Läpikuultava tausta";

/* nothing */
"Show marker line" = "Näytä lukumerkki";

/* nothing */
"Insert a red line after the last read text." = "Erottaa luetun ja lukemattoman tekstin punaisella viivalla.";

/* nothing */
"Transparency Settings" = "Läpikuultavuuden säätö";

/* nothing */
"Red:" = "Punainen:";

/* nothing */
"Green:" = "Vihreä:";

/* nothing */
"Blue:" = "Sininen:";

/* nothing */
"Time Stamps" = "Aikaleimat";

/* nothing */
"Enable time stamps" = "Näytä aikaleimat";

/* nothing */
"Time stamp format:" = "Aikaleiman muoto:";

/* nothing */
"See strftime manpage for details." = "Katso yksityiskohtaiset ohjeet manuaalisivulta strftime(3).";

/* nothing */
"A-Z" = "A-Z";

/* nothing */
"Last-spoke order" = "Puhumisajankohdan mukaan";

/* nothing */
"Input box" = "Syötekenttä";

/* nothing */
"Use the Text box font and colors" = "Käytä tekstilaatikon kirjasinta ja värejä";

/* nothing */
"Spell checking" = "Oikoluku";

/* nothing */
"Nick Completion" = "Kutsumanimien täydennys";

/* nothing */
"Automatic nick completion (without TAB key)" = "Automaattinen kutsumanimien täydennys (ilman tabulaattoria)";

/* nothing */
"Nick completion suffix:" = "Täydennyksen jälkiliite:";

/* nothing */
"Nick completion sorted:" = "Kutsumanimitäydennys aakkosjärjestyksessä:";

/* nothing */
"Input Box Codes" = "Syötekentän koodit";

/* nothing */
"Interpret %nnn as an ASCII value" = "Tulkitse %nnn ASCII-arvoksi";

/* nothing */
"Interpret %C, %B as Color, Bold etc" = "Tulkitse %C väriksi, %B lihavoinniksi, jne";

/* nothing */
"A-Z, Ops first" = "A-Z, opit ensimmäisinä";

/* nothing */
"Z-A, Ops last" = "Z-A, opit viimeisinä";

/* nothing */
"Z-A" = "Z-A";

/* nothing */
"Unsorted" = "Lajittelematon";

/* nothing */
"Left (Upper)" = "Vasemmalla (ylhäällä)";

/* nothing */
"Left (Lower)" = "Vasemmalla (alhaalla)";

/* nothing */
"Right (Upper)" = "Oikealla (ylhäällä)";

/* nothing */
"Right (Lower)" = "Oikealla (alhaalla)";

/* nothing */
"Top" = "Ylhäällä";

/* nothing */
"Bottom" = "Alhaalla";

/* nothing */
"Hidden" = "Piilotettu";

/* nothing */
"User List" = "Käyttäjäluettelo";

/* nothing */
"Show hostnames in user list" = "Näytä isäntänimet käyttäjäluettelossa";

/* nothing */
"User list sorted by:" = "Lajittelutapa:";

/* nothing */
"Show user list at:" = "Näytä käyttäjäluettelo:";

/* nothing */
"Away tracking" = "Poissaolojen seuranta";

/* nothing */
"Track the Away status of users and mark them in a different color" = "Seuraa poissaoloja ja näytä poissaolevat käyttäjät eri värillä,";

/* nothing */
"On channels smaller than:" = "kun kanavalla on käyttäjiä alle:";

/* nothing */
"Action Upon Double Click" = "Kaksoisnapsautuksen toiminto";

/* nothing */
"Execute command:" = "Suorita komento:";

/* nothing */
"Windows" = "Ikkunat";

/* nothing */
"Tabs" = "Välilehdet";

/* nothing */
"Always" = "Aina";

/* nothing */
"Only requested tabs" = "Vain itse avatut";

/* nothing */
"Channel Switcher" = "Kanavavalitsin";

/* nothing */
"Open an extra tab for server messages" = "Palvelinviestit omaan välilehteensä";

/* nothing */
"Open an extra tab for server notices" = "Palvelintiedotteet omaan välilehteensä";

/* nothing */
"Open a new tab when you receive a private message" = "Avaa uusi välilehti yksityisviestin saapuessa";

/* nothing */
"Sort tabs in alphabetical order" = "Välilehdet aakkosjärjestykseen";

/* nothing */
"Small tabs" = "Pienet korvakkeet";

/* nothing */
"Focus new tabs:" = "Uudet välilehdet etualalle:";

/* nothing */
"Show channel switcher at:" = "Näytä kanavavalitsin:";

/* nothing */
"Shorten tab labels to:" = "Typistä välilehtien nimet:";

/* nothing */
"letters." = "merkin pituisiksi.";

/* nothing */
"Tabs or Windows" = "Välilehti vai ikkuna";

/* nothing */
"Open channels in:" = "Kanavien avaamispaikka:";

/* nothing */
"Open dialogs in:" = "Keskusteluiden avaamispaikka:";

/* nothing */
"Open utilities in:" = "Apuvälineiden avaamispaikka:";

/* nothing */
"Open DCC, Ignore, Notify etc, in tabs or windows?" = "DCC:t, huomioimattomuudet, ilmoitukset jne.";

/* nothing */
"No" = "Ei";

/* nothing */
"Yes" = "Kyllä";

/* nothing */
"Browse for save folder every time" = "Valitse tallennushakemisto joka kerta";

/* nothing */
"Files and Directories" = "Tiedostot ja hakemistot";

/* nothing */
"Auto accept file offers:" = "Hyväksy tarjotut tiedostot automaattisesti:";

/* nothing */
"Download files to:" = "Lataa hakemistoon:";

/* nothing */
"Move completed files to:" = "Siirrä valmiit tiedostot hakemistoon:";

/* nothing */
"Save nick name in filenames" = "Liitä lähettäjän kutsumanimi tiedostonimiin";

/* nothing */
"Network Settings" = "Verkkoasetukset";

/* nothing */
"Get my address from the IRC server" = "Hae IP-osoite IRC-palvelimelta";

/* nothing */
"Asks the IRC server for your real address. Use this if you have a 192.168.*.* address!" = "Tiedustelee osoittettasi IRC-palvelimelta. Rastita, mikäli osoitteesi on esimerkiksi muotoa 192.168.*.*!";

/* nothing */
"DCC IP address:" = "DCC:n IP-osoite:";

/* nothing */
"Claim you are at this address when offering files." = "Tiedostoja väitetään lähetettävän tästä osoitteesta.";

/* nothing */
"First DCC send port:" = "Ensimmäinen DCC-lähetysportti";

/* nothing */
"Last DCC send port:" = "Viimeinen DCC-lähetysportti";

/* nothing */
"!Leave ports at zero for full range." = "Jätä nolliksi, jos haluat käyttöön kaikki portit.";

/* nothing */
"Maximum File Transfer Speeds (bytes per second)" = "Siirtonopeuksien ylärajat (tavua sekunnissa)";

/* nothing */
"One upload:" = "Yksittäinen lähetys:";

/* nothing */
"Maximum speed for one transfer" = "Yksittäisen siirron suurin sallittu nopeus.";

/* nothing */
"One download:" = "Yksittäinen lataus:";

/* nothing */
"All uploads combined:" = "Kaikki lähetykset yhteensä:";

/* nothing */
"Maximum speed for all files" = "Yhteenlaskettujen siirtojen suurin sallittu nopeus.";

/* nothing */
"All downloads combined:" = "Kaikki lataukset yhteensä:";

/* nothing */
"Alerts" = "Hälytykset";

/* nothing */
"Show tray balloons on:" = "Näytä puhekupla, kun tulee:";

/* nothing */
"Blink tray icon on:" = "Välkytä ilmoitusalueella, kun tulee:";

/* nothing */
"Blink task bar on:" = "Välkytä tehtäväpalkkia, kun tulee:";

/* nothing */
"Make a beep sound on:" = "Piipauta, kun tulee:";

/* nothing */
"Enable system tray icon" = "Ota ilmoitusalueen kuvake käyttöön";

/* nothing */
"Highlighted Messages" = "Korostettu viesti";

/* nothing */
"Highlighted messages are ones where your nickname is mentioned, but also:" = "Viesti korostetaan, kun siinä mainitaan kutsumanimesi tai:";

/* nothing */
"Extra words to highlight:" = "Muut korostettavat sanat:";

/* nothing */
"Nick names not to highlight:" = "Älä korosta viestejä käyttäjiltä:";

/* nothing */
"Nick names to always highlight:" = "Korosta aina viestit käyttäjiltä:";

/* nothing */
"Separate multiple words with commas." = "Erota sanat toisistaan pilkuilla.";

/* nothing */
"Default Messages" = "Oletusilmoitukset";

/* nothing */
"Quit:" = "Lopetus:";

/* nothing */
"Leave channel:" = "Kanavalta poistuminen:";

/* nothing */
"Away:" = "Poissaolo:";

/* nothing */
"Away" = "Poissaolo";

/* nothing */
"Announce away messages" = "Kuuluta poissaoloviestit";

/* nothing */
"Announce your away messages to all channels" = "Lähettää poissaoloviestit kaikille kanaville.";

/* nothing */
"Show away once" = "Näytä poissaoloviestit kerran";

/* nothing */
"Show identical away messages only once" = "Näyttää identtiset poissaoloviestit vain kerran.";

/* nothing */
"Automatically unmark away" = "Lopeta oma poissaolo automaattisesti";

/* nothing */
"Unmark yourself as away before sending messages" = "Merkitsee sinut läsnäolevaksi ennen viestien lähettämistä.";

/* nothing */
"Advanced Settings" = "Lisäasetukset";

/* nothing */
"Auto reconnect delay:" = "Automaattisen yhdistämisen viive:";

/* nothing */
"Display MODEs in raw form" = "Näytä tilat raakamuodossa";

/* nothing */
"Whois on notify" = "Suorita whois ilmoituksen yhteydessä";

/* nothing */
"Sends a /WHOIS when a user comes online in your notify list" = "Lähettää /WHOIS-komennon, kun ilmoitusluettelossa oleva käyttäjä on tavoitettavissa";

/* nothing */
"Hide join and part messages" = "Piilota liittymis- ja poistumisviestit";

/* nothing */
"Hide channel join/part messages by default" = "Piilota liittymis- ja poistumisviestit oletuksena";

/* nothing */
"Auto Open DCC Windows" = "Avaa DCC-ikkunat automaattisesti";

/* nothing */
"Send window" = "Lähetysikkuna";

/* nothing */
"Receive window" = "Vastaanottoikkuna";

/* nothing */
"Chat window" = "Kanavaikkuna";

/* nothing */
"Logging" = "Lokiasetukset";

/* nothing */
"Enable logging of conversations" = "Pidä keskusteluista lokia";

/* nothing */
"Log filename:" = "Lokitiedoston nimi:";

/* nothing */
"%s=Server %c=Channel %n=Network." = "%s=palvelin %c=kanava %n=verkko.";

/* nothing */
"Insert timestamps in logs" = "Lisää lokeihin aikaleimat";

/* nothing */
"Log timestamp format:" = "Lokitiedoston aikaleiman muoto:";

/* nothing */
"(Disabled)" = "(Pois käytöstä)";

/* nothing */
"Wingate" = "Wingate";

/* nothing */
"Socks4" = "Socks4";

/* nothing */
"Socks5" = "Socks5";

/* nothing */
"HTTP" = "HTTP";

/* nothing */
"MS Proxy (ISA)" = "MS Proxy (ISA)";

/* nothing */
"All Connections" = "Kaikille yhteyksille";

/* nothing */
"IRC Server Only" = "Vain IRC-palvelimille";

/* nothing */
"DCC Get Only" = "Vain DCC-siirroille";

/* nothing */
"Your Address" = "Oma IP-osoite";

/* nothing */
"Bind to:" = "Sido osoitteeseen:";

/* nothing */
"Only useful for computers with multiple addresses." = "Käyttökelpoinen vain, kun tietokoneessa on monta osoitetta.";

/* nothing */
"Proxy Server" = "Välipalvelin";

/* nothing */
"Hostname:" = "Isäntänimi:";

/* nothing */
"Port:" = "Portti:";

/* nothing */
"Type:" = "Tyyppi:";

/* nothing */
"Use proxy for:" = "Käytä välipalvelinta:";

/* nothing */
"Proxy Authentication" = "Välipalvelimelle tunnistautuminen";

/* nothing */
"Use Authentication (MS Proxy, HTTP or Socks5 only)" = "Tunnistaudu välipalvelimelle (vain MS Proxy, HTTP ja Socks5)";

/* nothing */
"Use Authentication (HTTP or Socks5 only)" = "Tunnistaudu välipalvelimelle (vain HTTP ja Socks5)";

/* nothing */
"Username:" = "Käyttäjänimi:";

/* nothing */
"Password:" = "Salasana:";

/* nothing */
"Select an Image File" = "Valitse kuvatiedosto";

/* nothing */
"Select Download Folder" = "Valitse latauskansio";

/* nothing */
"Select font" = "Valitse kirjasin";

/* nothing */
"Browse..." = "Selaa...";

/* nothing */
"Mark identified users with:" = "Merkitse tunnistetut käyttäjät seuraavasti:";

/* nothing */
"Mark not-identified users with:" = "Merkitse tuntemattomat käyttäjät seuraavasti:";

/* nothing */
"Open Data Folder" = "Avaa datakansio";

/* nothing */
"Select color" = "Valitse väri";

/* nothing */
"Text Colors" = "Tekstin värit";

/* nothing */
"mIRC colors:" = "mIRC-värit:";

/* nothing */
"Local colors:" = "Omat värit";

/* nothing */
"Foreground:" = "Edustaväri:";

/* nothing */
"Background:" = "Taustaväri:";

/* nothing */
"Marking Text" = "Tekstin maalaus";

/* nothing */
"Interface Colors" = "Käyttöliittymän värit";

/* nothing */
"New data:" = "Uusi data:";

/* nothing */
"Marker line:" = "Lukumerkkiviiva:";

/* nothing */
"New message:" = "Uusi viesti:";

/* nothing */
"Away user:" = "Poissaolijat:";

/* nothing */
"Highlight:" = "Korostus:";

/* nothing */
"Event" = "Tapahtuma";

/* nothing */
"Sound file" = "Äänitiedosto";

/* nothing */
"Select a sound file" = "Valitse äänitiedosto";

/* nothing */
"Sound playing method:" = "Äänensoittotapa:";

/* nothing */
"External sound playing _program:" = "Ulkoinen soitto-ohjelma:";

/* nothing */
"_External program" = "Ulkoisella ohjelmalla";

/* nothing */
"_Automatic" = "Automaattinen";

/* nothing */
"Sound files _directory:" = "Äänitiedostojen hakemisto:";

/* nothing */
"Sound file:" = "Äänitiedosto: ";

/* nothing */
"_Browse..." = "Selaa...";

/* nothing */
"_Play" = "Soita";

/* nothing */
"Interface" = "Käyttöliittymä";

/* nothing */
"Text box" = "Tekstilaatikko";

/* nothing */
"User list" = "Käyttäjäluettelo";

/* nothing */
"Channel switcher" = "Kanavavalitsin";

/* nothing */
"Colors" = "Värit";

/* nothing */
"Chatting" = "Keskustelu";

/* nothing */
"General" = "Yleiset";

/* nothing */
"Sound" = "Ääni";

/* nothing */
"Network setup" = "Verkkoasetukset";

/* nothing */
"File transfers" = "Tiedostonsiirrot";

/* nothing */
"Categories" = "Asetusryhmät";

/* nothing */
"You cannot place the tree on the top or bottom!\nPlease change to the <b>Tabs</b> layout in the <b>View</b> menu first." = "Puuta ei voi laittaa ylös eikä alas!\nMuuta ensin välilehtiasettelua <b>Näytä</b>-valikosta.";

/* nothing */
"Some settings were changed that require a restart to take full effect." = "Osa muutoksista tulee voimaan vasta kun ohjelma käynnistetään uudestaan.";

/* nothing */
"*WARNING*\nAuto accepting DCC to your home directory\ncan be dangerous and is exploitable. Eg:\nSomeone could send you a .bash_profile" = "*VAROITUS*\nDCC-siirtojen automaattinen hyväksyminen\nkotihakemistoon voi olla vaarallista. Esim:\nJoku voi lähettää tiedoston .bash_profile.";

/* nothing */
"XChat: Preferences" = "XChat: Ominaisuudet";

/* nothing */
"There was an error parsing the string" = "Virhe jäsennettäessä merkkijonoa";

/* nothing */
"This signal is only passed %d args, $%d is invalid" = "Tälle signaalille annetaan vain %d argumenttia, $%d on virheellinen";

/* nothing */
"Print Texts File" = "Tallenna tekstitiedosto";

/* nothing */
"Edit Events" = "Muokkaa tapahtumatekstejä";

/* nothing */
"$ Number" = "$ Numero";

/* nothing */
"Load From..." = "Lataa...";

/* nothing */
"Test All" = "Kokeile kaikki";

/* nothing */
"URL" = "URL";

/* nothing */
"XChat: URL Grabber" = "XChat: URL-kaappaaja";

/* nothing */
"Clear list" = "Tyhjennä luettelo";

/* nothing */
"Copy selected URL" = "Kopioi valittu URL";

/* nothing */
"Copy" = "Kopioi";

/* nothing */
"Save list to a file" = "Tallenna luettelo tiedostoon";

/* nothing */
"%d ops, %d total" = "%d oppia, %d yhteensä";

